{"records": [{"Topic": "From Matrix to Tensor: The Search for Low-Rank Approximations ", "Speaker": "Charlie Van Loan", "Description": "", "Time": "2016-01-04", "URL": "http://www.cs.cornell.edu/cv/", "University": "Cornell University", "Tags": "", "Venue": "G01 Gates Hall - Mentor's Lecture Hall"}, {"Topic": "Provably Efficient Algorithms as Tensor Equations ", "Speaker": "Edgar Solomonik", "Description": "", "Time": "2016-02-02", "URL": "https://www.inf.ethz.ch/personal/edgar.solomonik/", "University": "Cornell University", "Tags": "", "Venue": "G01 Gates Hall - Mentor's Lecture Hall"}, {"Topic": "Querying Without Keyboards: Challenges in Gesture-driven Data Exploration", "Speaker": "Arnab Nandi", "Description": "", "Time": "2016-02-04", "URL": "http://arnab.org", "University": "Cornell University", "Tags": "", "Venue": "G01 Gates Hall - Mentor's Lecture Hall"}, {"Topic": "Efficient algorithms from sparsity &amp; structure: computational methods for ", "Speaker": "Anil Damle", "Description": "", "Time": "2016-02-04", "URL": "http://web.stanford.edu/~damle/", "University": "Cornell University", "Tags": "", "Venue": "G01 Gates Hall - Mentor's Lecture Hall"}, {"Topic": "Unleashing Hardware Potential through Better OS Abstractions", "Speaker": "Adam Belay", "Description": "", "Time": "2016-02-04", "URL": "http://www.scs.stanford.edu/~abelay/", "University": "Cornell University", "Tags": "", "Venue": "G01 Gates Hall - Mentor's Lecture Hall"}, {"Topic": ">Teaching Old Sensors New Tricks", "Speaker": "Mayank Goel", "Description": "", "Time": "2016-02-02", "URL": "http://homes.cs.washington.edu/~mayank/mayankgoel_cv.pdf", "University": "Cornell University", "Tags": "", "Venue": "G01 Gates Hall - Mentor's Lecture Hall"}, {"Topic": "Randomness, Algebra, and Computation", "Speaker": "Michael Forbes", "Description": "", "Time": "2016-02-04", "URL": "http://www.mit.edu/~miforbes/", "University": "Cornell University", "Tags": "", "Venue": "G01 Gates Hall - Mentor's Lecture Hall"}, {"Topic": "", "Speaker": "Arun Kumar", "Description": "", "Time": "2016-03-02", "URL": "http://pages.cs.wisc.edu/~arun/", "University": "Cornell University", "Tags": "", "Venue": "G01 Gates Hall - Mentor's Lecture Hall"}, {"Topic": "Scalable Gaussian Processes for Scientific Discovery", "Speaker": "Andrew Wilson", "Description": "", "Time": "2016-03-03", "URL": "http://www.cs.cmu.edu/~andrewgw/", "University": "Cornell University", "Tags": "", "Venue": "G01 Gates Hall - Mentor's Lecture Hall"}, {"Topic": "Middleboxes as a cloud service", "Speaker": "Justine Sherry", "Description": "", "Time": "2016-03-04", "URL": "http://www.cs.berkeley.edu/~justine/", "University": "Cornell University", "Tags": "", "Venue": "G01 Gates Hall - Mentor's Lecture Hall"}, {"Topic": "Adaptive Crowd Algorithms for Open-Ended Problems", "Speaker": "Lydia Chilton", "Description": "", "Time": "2016-03-01", "URL": "http://hmslydia.com/", "University": "Cornell University", "Tags": "", "Venue": "G01 Gates Hall - Mentor's Lecture Hall"}, {"Topic": "Query optimization for data science ", "Speaker": "Immanuel Trummer", "Description": "", "Time": "2016-03-02", "URL": "http://www.itrummer.org/", "University": "Cornell University", "Tags": "", "Venue": "G01 Gates Hall - Mentor's Lecture Hall"}, {"Topic": "The Role of Interaction in Parallel Computing and Economics ", "Speaker": "O", "Description": "", "Time": "2016-03-04", "URL": "http://www.philkr.net/", "University": "Cornell University", "Tags": "", "Venue": "G01 Gates Hall - Mentor's Lecture Hall"}, {"Topic": "Breaking Barriers between Humans and Geometry", "Speaker": "Alec Jacobson", "Description": "", "Time": "2016-03-02", "URL": "http://www.cs.columbia.edu/~jacobson/", "University": "Cornell University", "Tags": "", "Venue": "G01 Gates Hall - Mentor's Lecture Hall"}, {"Topic": "Building Systems that Query on Compressed Data", "Speaker": "Rachit Agarwal", "Description": "", "Time": "2016-03-02", "URL": "http://www.cs.berkeley.edu/~rachit/", "University": "Cornell University", "Tags": "", "Venue": "G01 Gates Hall - Mentor's Lecture Hall"}, {"Topic": "Improving the Efficiency and Reliability of Data Center Networks", "Speaker": "V", "Description": "", "Time": "2016-03-04", "URL": "http://www.cs.princeton.edu/~oweinste/", "University": "Cornell University", "Tags": "", "Venue": "G01 Gates Hall - Mentor's Lecture Hall"}, {"Topic": "The many ways to understand the pixels", "Speaker": "Philipp Krähenbühl", "Description": "", "Time": "2016-04-02", "URL": "http://www.philkr.net/", "University": "Cornell University", "Tags": "", "Venue": "G01 Gates Hall - Mentor's Lecture Hall"}, {"Topic": "Exploiting compositionality to explore a large space of model structures", "Speaker": "Roger Grosse", "Description": "", "Time": "2016-04-04", "URL": "http://www.cs.toronto.edu/~rgrosse/", "University": "Cornell University", "Tags": "", "Venue": "G01 Gates Hall - Mentor's Lecture Hall"}, {"Topic": "Physically-Based Simulation for Animation and Fabrication", "Speaker": "D", "Description": "", "Time": "2016-04-02", "URL": "http://homes.cs.washington.edu/~vincent/", "University": "Cornell University", "Tags": "", "Venue": "G01 Gates Hall - Mentor's Lecture Hall"}, {"Topic": "Topic/Title TBD", "Speaker": "Aditya Khosla", "Description": "", "Time": "2016-04-04", "URL": "https://people.csail.mit.edu/khosla/", "University": "Cornell University", "Tags": "", "Venue": "G01 Gates Hall - Mentor's Lecture Hall"}, {"Topic": "Interactive Machine Learning for Information Extraction", "Speaker": "Sameer Singh", "Description": "", "Time": "2016-04-02", "URL": "http://sameersingh.org/", "University": "Cornell University", "Tags": "", "Venue": "G01 Gates Hall - Mentor's Lecture Hall"}, {"Topic": "Topic/Title TBD", "Speaker": "Dimitris Papailiopoulos", "Description": "", "Time": "2016-04-04", "URL": "http://www.eecs.berkeley.edu/~dimitrisp/", "University": "Cornell University", "Tags": "", "Venue": "G01 Gates Hall - Mentor's Lecture Hall"}, {"Topic": "Wireless Systems that Extend Our Senses: Seeing Through Walls, Gesture Control, and Vital Sign Monitoring", "Speaker": "Fadel Adib", "Description": "", "Time": "2016-04-02", "URL": "https://people.csail.mit.edu/fadel/", "University": "Cornell University", "Tags": "", "Venue": "G01 Gates Hall - Mentor's Lecture Hall"}, {"Topic": "Topic/Title TBD", "Speaker": "Ethan Katz-Bassett", "Description": "", "Time": "2016-04-04", "URL": "http://www-bcf.usc.edu/~katzbass/", "University": "Cornell University", "Tags": "", "Venue": "G01 Gates Hall - Mentor's Lecture Hall"}, {"Topic": "Topic/Title TBD", "Speaker": "Jonathan Ragan-Kelley", "Description": "", "Time": "2016-05-02", "URL": "http://people.csail.mit.edu/jrk/", "University": "Cornell University", "Tags": "", "Venue": "G01 Gates Hall - Mentor's Lecture Hall"}, {"Topic": "Topic/Title TBD", "Speaker": "Tong Zhang", "Description": "", "Time": "2016-05-04", "URL": "http://www.stat.rutgers.edu/home/tzhang/", "University": "Cornell University", "Tags": "", "Venue": "G01 Gates Hall - Mentor's Lecture Hall"}, {"Topic": "", "Speaker": "", "Description": "", "Time": "2016-05-02", "URL": "", "University": "Cornell University", "Tags": "", "Venue": "G01 Gates Hall - Mentor's Lecture Hall"}, {"Topic": "", "Speaker": "", "Description": "", "Time": "2016-05-04", "URL": "", "University": "Cornell University", "Tags": "", "Venue": "G01 Gates Hall - Mentor's Lecture Hall"}, {"Topic": "Getting More Women into Tech Careers and Why It Matters", "Speaker": "Maria Klawe", "Description": "", "Time": "2016-01-20", "URL": "http://www.eecs.berkeley.edu/Colloquium/Archives/15-16/Spring2016/klawe.shtml", "University": "University of California, Berkeley", "Tags": "", "Venue": "HP Auditorium, 306 Soda Hall"}, {"Topic": "Transforming Nanodevices into Nanosystems: The N3XT 1,000X", "Speaker": "Subhasish Mitra", "Description": "", "Time": "2016-01-27", "URL": "http://www.eecs.berkeley.edu/Colloquium/Archives/15-16/Spring2016/mitra.shtml", "University": "University of California, Berkeley", "Tags": "", "Venue": "HP Auditorium, 306 Soda Hall"}, {"Topic": "DeepDive: A Dark Data System", "Speaker": "Chris Ré", "Description": "", "Time": "2016-02-03", "URL": "http://www.eecs.berkeley.edu/Colloquium/Archives/15-16/Spring2016/re.shtml", "University": "University of California, Berkeley", "Tags": "", "Venue": "HP Auditorium, 306 Soda Hall"}, {"Topic": "Learning Structured, Robust, and Multimodal Deep Models", "Speaker": "Ruslan Salakhutdinov", "Description": "", "Time": "2016-02-10", "URL": "http://www.eecs.berkeley.edu/Colloquium/Archives/15-16/Spring2016/salakhutdinov.shtml", "University": "University of California, Berkeley", "Tags": "", "Venue": "HP Auditorium, 306 Soda Hall"}, {"Topic": "Sum-Product Networks: Deep Models with Tractable Inference", "Speaker": "Pedro Domingos", "Description": "", "Time": "2016-02-17", "URL": "http://www.eecs.berkeley.edu/Colloquium/Archives/15-16/Spring2016/domingos.shtml", "University": "University of California, Berkeley", "Tags": "", "Venue": "HP Auditorium, 306 Soda Hall"}, {"Topic": "Integrative genomic data analysis to understand interactions between metabolic, transcriptional, epigenetic states in stem cell biology", "Speaker": "Yuliang Wang (UIUC/OHSU)", "Description": "Biomedical research is generating a huge amount of genomic data. Extracting knowledge from Big Data to guide novel biological discovery is critical to fully realize its potential. However, high-dimensional genomic data is known for its heterogeneity and noise.  One important way to enrich for true signal is to examine its effects in different but complementary data types (e.g., mRNA expression, histone modification, and metabolite abundance). In this talk, I will present my work on integrating multiple types of data to study how cellular metabolic, transcriptional and epigenetic states interact in stem cell biology. First I will present a computational method that integrates gene expression, metabolite abundance and flux, and network topology to infer genome-scale cell type-specific metabolic networks. Then I will present a case study where the integration of gene expression and metabolite abundance data leads to the discovery of a metabolic enzyme controlling the level of repressive histone modifications, which in turn regulate a set of genes critical for early human development. I will also present a new approach to identify genes that regulate lineage-specific differentiation by integrating gene expression and histone modification ChIP-seq data. In the future, leveraging large genomic datasets from the ENCODE project, NIH Roadmap Epigenomics project and the FANTOM5 project, cell type-specific metabolic networks will be reconstructed as a framework to understand how developmental transcription factors affect metabolism, the pattern of epigenetic modifications in the metabolic network, and critical nodes in the metabolic network that affect epigenetic status. \n  \nBio: \nYuliang Wang is a Senior Research Associate in the Computational Biology Program, School of Medicine at Oregon Health & Science University. He received his PhD in Chemical Engineering and MS in Applied Statistics from University of Illinois, Urbana-Champaign in 2013. He did his postdoctoral training in computational biology at Sage Bionetworks in Seattle (2013-2014).\n\n", "Time": "2016-02-01 10:00:00", "URL": "http://www.cs.washington.edu/htbin-post/mvis/mvis?ID=2853", "University": "University of Washington", "Tags": "", "Venue": "Gates Commons, 691 Paul G Allen Center for Computer Science & Engineering"}, {"Topic": "The Array of Things: Resilient, Autonomous, Urban-Scale Sensor Networks", "Speaker": "Charlie  Catlett (Argonne National Laboratory and the University of Chicago)", "Description": "Cities are increasingly publishing data about their operations while also internally using data to improve the effectiveness and quality of services through optimization, predictive analytics, and other methods.  This represents new opportunities for collaboration between cities, national laboratories, and universities in areas ranging from scalable data infrastructure to tools for data analytics, along with challenges such as replicability of solutions between cities, integrating and validating data for scientific investigation, and protecting privacy.  For many urban questions, new data sources will be required with greater spatial and/or temporal resolution, driving innovation in the use of sensor in mobile devices as well as embedded sensing infrastructure in the built environment.  Catlett will discuss the work that Argonne National Laboratory and the University of Chicago are doing in partnership with the City of Chicago and other cities through the Urban Center for Computation and Data, focusing on key scalable data infrastructure, data analytics, and resilient autonomous urban-scale sensor networks.\n  \nBio: \nCharlie Catlett is a Senior Computer Scientist at Argonne National Laboratory and a Senior Fellow at the Computation Institute of the University of Chicago and Argonne, where he is founding director of the Urban Center for Computation and Data (UrbanCCD). He is also a Visiting Artist at the School of the Art Institute of Chicago.  Catlett is working with scientists from area universities and laboratories, members of the technical community in the Chicago area and city policymakers to explore science-based approaches to opportunities and challenges of city design and operation.  \n  \nFrom 2007 to 2011 Catlett was the Chief Information Officer at Argonne, and from 2004 to 2007 he was Director of the National Science Foundation's TeraGrid initiative - a nationally distributed supercomputing facility involving fifteen universities and federal laboratories. Before joining the UChicago and Argonne in 2000, Catlett was Chief Technology Officer at the National Center for Supercomputing Applications at the University of Illinois at Urbana-Champaign.  At NCSA he participated, beginning at NCSA's founding in 1985, in the development of NSFNET, one of several early national networks that evolved into what we now experience as the Internet. Following the release of NCSA's Mosaic web browser, he and his team at NCSA helped develop and support scalable web server infrastructure.\n  \nFrom 1999 to 2004 Catlett directed the design and deployment of the I-WIRE optical network, funded by the State of Illinois, which connects research institutions in the Chicago area and downstate Illinois with a dedicated fiber optic network for research and education.   Catlett received a B.S. in Computer Engineering from the University of Illinois, Urbana-Champaign in 1983.", "Time": "2016-02-02 15:30:00", "URL": "http://www.cs.washington.edu/htbin-post/mvis/mvis?ID=2829", "University": "University of Washington", "Tags": "", "Venue": ""}, {"Topic": "Designing Robot Collectives", "Speaker": "Kirstin H Petersen (Harvard University/Max Planck Institute for Intelligent Systems)", "Description": "In robot collectives, interactions between large numbers of individually simple robots lead to complex global behaviors. A great source of inspiration is social insects such as ants and bees, where thousands of individuals coordinate to handle advanced tasks like food supply and nest construction in a remarkably scalable and error tolerant manner. Likewise, robot swarms have the ability to address tasks beyond the reach of single robots, and promise more efficient parallel operation and greater robustness due to redundancy. Key challenges involve both control and physical implementation. In this seminar I will discuss an approach to such systems relying on embodied intelligent robots designed as an integral part of their environment, where passive mechanical features replace the need for complicated sensors and control.\n   The majority of my talk will focus on a team of robots for autonomous construction of user-specified three-dimensional structures developed during my thesis. Additionally, I will give a brief overview of my research on the Namibian mound-building termites that inspired the robots. Finally, I will talk about my current research thrust, enabling stand-alone centimeter-scale soft robots to eventually be used in swarm robotics as well. My work advances the aim of collective robotic systems that achieve human-specified goals, using biologically-inspired principles for robustness and scalability.\n  \nShort Bio:  \nKirstin Petersen is a Postdoc with the Physical Intelligence Department at the Max Planck Institute for Intelligent Systems in Germany. Here, she develops novel soft actuators to enable stand-alone centimeter-scale soft robots. Kirstin finished her Ph.D. in computer science at Harvard University and the Wyss Institute for Biologically Inspired Engineering in 2014, her thesis topic a combination of termite-inspired robots for collective construction and corresponding studies of the real termites. This work was featured in and on the cover of Science in February 2014, and was elected among the top ten scientific breakthroughs of 2014. Kirstin completed her M.Sc. in modern artificial intelligence in 2008 and a B.Sc. in electro-technical engineering in 2005, both with the University of Southern Denmark. In her spare time Kirstin is an avid hiker and traveler.", "Time": "2016-02-09 15:30:00", "URL": "http://www.cs.washington.edu/htbin-post/mvis/mvis?ID=2864", "University": "University of Washington", "Tags": "", "Venue": "EEB-105"}, {"Topic": "Overcoming Overfitting with Algorithmic Stability", "Speaker": "Moritz Hardt (Princeton/Google Research)", "Description": "Most applications of machine learning across science and industry rely on the holdout method for model selection and validation. Unfortunately, the holdout method often fails in the now common scenario where the analyst works interactively with the data, iteratively choosing which methods to use by probing the same holdout data many times.\n  \nIn this talk, we apply the principle of algorithmic stability to design reusable holdout methods, which can be used many times without losing the guarantees of fresh data. Applications include a model benchmarking tool that detects and prevents overfitting at scale.\n  \nWe conclude with a bird's eye view of what algorithmic stability says about machine learning at large, including new insights into stochastic gradient descent, the most popular optimization method in contemporary machine learning.\n  \nShort bio: \nMoritz Hardt is a senior research scientist at Google Research. After obtaining a PhD in computer science from Princeton University in 2011, he worked at IBM Research Almaden on algorithmic principles of machine learning. Then he moved to Google to join the Foundations of Applied Machine Learning group where his mission is to build guiding theory and scalable algorithms that make the practice of machine learning more reliable, transparent, and effective.\n", "Time": "2016-02-11 15:30:00", "URL": "http://www.cs.washington.edu/htbin-post/mvis/mvis?ID=2848", "University": "University of Washington", "Tags": "", "Venue": "EEB-105"}, {"Topic": "From Moore's Law to Moore's Crawl: Architecting the Next Generation of Mobile Computing Devices", "Speaker": "Vijay Janapa Reddi (Harvard University/UT Austin)", "Description": "Moore's Law has historically been the driving force behind computing industry innovation. Today, the computing industry as a whole is facing several challenges on all the key frontiers of microprocessor innovation and development. Generational improvements in processor performance, continual reductions in its power consumption, and sustained hardware execution reliability have all but reached a plateau, if not begun to falter, due to technology scaling issues. These challenges affect all domains of computing, ranging from mobile devices to high-performance systems. This talk focuses specifically on end-user mobile computing devices, outlining the challenges that face us in building future high-performance mobile devices that are responsive on a mobile power budget. By examining the mobile application software stack and the existing processor architectures that support it, the talk presents how to bridge the increasing gap between end-user satisfaction and energy-efficient mobile computing. Domain-specific architectures, coupled with feedback-directed runtime software optimization that is guided by programmer-driven annotations, can enable us to build future high-performance, energy-efficient mobile computing devices. Synergistic, and systematic, cross-layer optimization is a fundamental necessity for overcoming the performance, power and reliability challenges that mark the \"end\" of the Moore's Law era and the beginning of the Moore's crawl period.\n  \nBiography: \nVijay Janapa Reddi is an Assistant Professor in the Department of Electrical and Computer Engineering at The University of Texas at Austin. His research interests include system architecture and software design and implementation to address performance, power, energy and reliability issues for mobile and high-performance computing systems. He is the recipient of the Intel Early Career Award, PLDI Most Influential Paper Award, and Best Paper and Top Picks awards in Computer Architecture. Beyond his research activities, Vijay is very passionate about STEM education, particularly involving computer science education starting at an early age. He is responsible for the Hands-On Computer Science (HaCS) curriculum that teaches computer science to middle school students in the Austin Independent School District (AISD) through Arduino-based hands-on projects. AISD ties directly into the heart of the public education system in Austin, Texas. Vijay received his Ph.D. in Computer Science from Harvard University. He can be contacted at vj@ece.utexas.edu.\n", "Time": "2016-02-18 15:30:00", "URL": "http://www.cs.washington.edu/htbin-post/mvis/mvis?ID=2847", "University": "University of Washington", "Tags": "", "Venue": "EEB-105"}, {"Topic": "Towards Deep Convolutional Methods without Supervision", "Speaker": "Zaid Harchaoui (Telecom Paris Tech/New York University)", "Description": "NOTE: This talk will NOT be broadcast live.  It will be taped only for internal use.\n  \nWe introduce a new kernel-based approach for the design of multi-layer convolutional feature representations for signals and images. The majority of deep convolutional neural networks (ConvNets) require supervision to learn state-of-the-art feature representations, which can be problematic for real-world applications where supervision can be expensive or unconceivable. Unsupervised learning of feature representations is currently a major open problem. \n  \nThe proposed approach allow to define a feature representation that is based on a kernel (feature) map. The exact version of this feature representation is data-independent. An explicit kernel (feature) map can be computed to approximate it for computational efficiency, without the need for supervision. We illustrate the potential of the approach on several applications: i) patch matching; ii) image retrieval; iii) image classification. We settle new state-of-the-art, or compete on par with state-of-the-art methods, on public benchmarks for all three computer vision tasks. \n  \nBio: \nZaid Harchaoui is currently Visiting Assistant Professor at the Courant Institute for Mathematical Sciences of NYU. Zaid was a permanent researcher at Inria from 2010 to 2015. He received his PhD from ParisTech (Paris, France). He received the Inria award for scientific excellence and the NIPS reviewer award. He gave a tutorial on \"Frank-Wolfe, greedy algorithms, and friends\" at ICML'14, on \"Large-scale visual recognition\" at CVPR'13, and on \"Machine Learning for Computer Vision\" at MLSS Kyoto 2015. He recently co-organized the workshop on “Optimization for Machine Learning” at NIPS'14, and the \"Optimization and Statistical Learning\" workshop in 2015 and 2013 in Ecole de Physique des Houches (France). He is associate editor of IEEE Signal Processing Letters. He is Area Chair for ICML 2015, ICML 2016, and NIPS 2016.  ", "Time": "2016-02-23 15:30:00", "URL": "http://www.cs.washington.edu/htbin-post/mvis/mvis?ID=2859", "University": "University of Washington", "Tags": "", "Venue": "EEB-105"}, {"Topic": "Interacting with Personal Fabrication Machines", "Speaker": "Stefanie Mueller (Hasso Plattner Institute)", "Description": "Even though considered a rapid prototyping tool, 3D printers are very slow. Many objects require several hours of printing time or even have to print overnight. One could argue that the way 3D printers are currently operated is similar to the batch processing of punched cards in the early days of computing: all input parameters are pre-defined in the 3D modeling stage, the 3D printer then simply executes the instructions without human intervention. Since batch processing requires carefully thinking ahead, it is limited to expert users who can reason about the consequences of their design decisions.\n\nIn the history of computing, moving away from batch processing enabled completely new interaction paradigms: while batch processing required carefully thinking ahead, command line input allowed for tighter feedback loops, and direct manipulation finally enabled even novice users to quickly iterate towards a solution. I believe repeating this evolution for the editing of physical matter will enable novice users to build objects only trained experts can create today.\n\nIn this talk, I show how technological advances in two areas lay the foundation for achieving this goal: First, we need to develop tools that allow novice users to directly manipulate physical matter under computer control. Second, since direct manipulation requires feedback in real-time after every editing step, we need faster fabrication techniques that can accomplish instant physical change.\n\nBio\nStefanie Mueller is a PhD student working with Patrick Baudisch in the Human-Computer Interaction Lab at Hasso Plattner Institute. In her research, she develops novel hardware and software systems that advance personal fabrication technologies. Stefanie has published 10 papers at the most selective HCI venues CHI and UIST, for which she received a best paper award and two best paper nominees. She is also serving on the CHI and UIST program committees as an associate chair. In addition, Stefanie has been an invited speaker at universities and research labs, such as MIT, CMU, Cornell, Microsoft Research, Disney Research, and Adobe Research.\n", "Time": "2016-02-25 15:30:00", "URL": "http://www.cs.washington.edu/htbin-post/mvis/mvis?ID=2845", "University": "University of Washington", "Tags": "", "Venue": "EEB-105"}, {"Topic": "TBD", "Speaker": " TBD (TBD)", "Description": "TBD", "Time": "2016-03-01 15:30:00", "URL": "http://www.cs.washington.edu/htbin-post/mvis/mvis?ID=2846", "University": "University of Washington", "Tags": "", "Venue": "EEB-105"}, {"Topic": "Exploiting compositionality to explore a large space of model structures", "Speaker": "Roger B Grosse (MIT/University of Toronto)", "Description": "I will present flexible algorithms for model discovery and model fitting which apply to broad, open-ended classes of models, yet which also incorporate model-specific algorithmic insights. First, I will introduce a framework for building probabilistic models compositionally out of common modeling motifs, such as clustering, sparsity, and dimensionality reduction. This compositional framework yields a variety of existing models as special cases. We can flexibly perform posterior inference across this large, open-ended space of models by composing sophisticated inference algorithms carefully designed for the individual modeling motifs. An automatic structure search procedure over this space of models yields sensible analyses of datasets as diverse as motion capture, natural image patches, and Senate voting records, all using a single software package with no hand-tuned metaparameters. Applying a similar compositional structure search procedure to Gaussian Process models yields interpretable decompositions of diverse time series datasets and enables automatic generation of natural language reports.  Finally, compositional structure search depends crucially on the estimation of intractable likelihoods. I will briefly outline an approach for obtaining precise likelihood estimates with rigorous tail bounds by sandwiching the true value between stochastic upper and lower bounds.\n\nBio\nRoger Grosse is a Postdoctoral Fellow in the University of Toronto machine learning group. He received his Ph.D. in computer science from MIT under the supervision of of Bill Freeman. He is a recipient of the NDSEG Graduate Fellowship, the Banting Postdoctoral Fellowship, and outstanding paper awards at the International Conference of Machine Learning (ICML) and the Conference for Uncertainty in AI (UAI). He is also a co-creator of Metacademy, an open-source web site for developing personalized learning plans in machine learning and related fields.", "Time": "2016-03-03 15:30:00", "URL": "http://www.cs.washington.edu/htbin-post/mvis/mvis?ID=2850", "University": "University of Washington", "Tags": "", "Venue": "EEB-105"}, {"Topic": "Fully Verified Outsourced Computation", "Speaker": "Bryan Parno (Microsoft Research)", "Description": "This talk will be taped for internal UW CSE faculty use only.  It will not be available for on-demand viewing.\n  \nFrequent headline-grabbing data breaches suggest that current best practices for safeguarding personal data are woefully inadequate.  To try to move beyond the cycle of attacks and patches we see today, I design and build systems with formal end-to-end guarantees.  For example, to provide strong guarantees for outsourced computations, I developed a new cryptographic framework, verifiable computation, which allows clients to outsource general computations to completely untrusted services and efficiently verify the correctness of each returned result.  Through improvements to the theory and the underlying systems, we reduced the costs of verification by over twenty orders of magnitude.  As a result, verifiable computation is now a thriving research area that has produced several startups, as well as enhancements to the security and privacy of X.509, MapReduce, and Bitcoin.\n\nWhile verifiable computation provides strong guarantees, even the best cryptographic system is useless if implemented badly, applied incorrectly, or used in a vulnerable system.  Thus, I have led a team of researchers and engineers in the Ironclad project, working to expand formal software verification to provide end-to-end guarantees about the security and reliability of complex systems.  By creating a set of new tools and methodologies, Ironclad produced the first complete stack of verified-secure software.  We also recently developed the first methodology for verifying both the safety and liveness of complex distributed systems implementations.  While interesting challenges remain, I expect that verification will fundamentally improve the software that underpins our digital and physical infrastructure.\n\nBio\nBryan Parno is a Researcher in the Security and Privacy Group at Microsoft Research.  After receiving a Bachelor's degree from Harvard College, he completed his PhD at Carnegie Mellon University, where his dissertation won the 2010 ACM Doctoral Dissertation Award.  In 2011, he was selected for Forbes' 30-Under-30 Science List.  He formalized and worked to optimize verifiable computation, receiving a Best Paper Award at the IEEE Symposium on Security and Privacy his advances.  He coauthored a book on Bootstrapping Trust in Modern Computers, and his work in that area has been incorporated into the latest security enhancements in Intel CPUs. His research into security for new application models was incorporated into Windows and received a Best Paper Awards at the IEEE Symposium on Security and Privacy and the USENIX Symposium on Networked Systems Design and Implementation.  He has recently extended his interest in bootstrapping trust to the problem of building practical, formally verified secure systems. His other research interests include user authentication, secure network protocols, and security in constrained environments (e.g., RFID tags, sensor networks, or vehicles).", "Time": "2016-03-10 15:30:00", "URL": "http://www.cs.washington.edu/htbin-post/mvis/mvis?ID=2844", "University": "University of Washington", "Tags": "", "Venue": "EEB-105"}, {"Topic": "Unleashing Hardware Potential through Better OS Abstractions", "Speaker": "Adam Matthew Belay (Stanford University)", "Description": "NOTE: This talk will be taped only for internal UW CSE faculty use - it will not be broadcast live and it won't be available for viewing on-demand.\n  \nDatacenter workloads have demanding performance requirements, including the simultaneous need for high throughput, low tail latency, and high server utilization. While modern hardware is compatible with these goals, modern operating systems remain a bottleneck. Better OS abstractions could significantly improve performance, yet deploying these abstractions has become intractable given the size and complexity of today's systems.\n  \nI will first discuss Dune, a kernel extension that allows OS developers to sidestep software and hardware complexity by running an OS within an ordinary Linux process.  With Dune, developers can both access the capabilities of raw hardware and fall back on the functionality of a full Linux environment where convenient. I will then discuss IX and Shinjuku, two generations of new datacenter-focused operating systems that were enabled by Dune. IX provides a novel system call interface that greatly improves network throughput without sacrificing latency. For example, IX improves Memcached's TCP throughput by 5x over Linux. Shinjuku, an ongoing research effort, aims to significantly increase CPU utilization through a centralized approach to intra-server load balancing.\n  \nBio: \nAdam Belay is a Ph.D. candidate in Computer Science at Stanford University, where he is a member of the Secure Computer Systems Group and the Multiscale Architecture and Systems Team. Previously, he worked on storage virtualization at VMware Inc. and contributed substantial power management code to the Linux Kernel project.  Adam's research area is operating systems and networking.  Much\nof his work has focused on restructuring computer systems so that developers can more easily reach the full performance potential of hardware. Adam has received a Stanford Graduate Fellowship, a VMware Graduate Fellowship, and an OSDI Jay Lepreau Best Paper Award.", "Time": "2016-03-29 15:30:00", "URL": "http://www.cs.washington.edu/htbin-post/mvis/mvis?ID=2855", "University": "University of Washington", "Tags": "", "Venue": "EEB-105"}, {"Topic": "Organizing Computation for High-Performance Visual Computing", "Speaker": "Jonathan Ragan-Kelley (MIT/Stanford)", "Description": "NOTE: This talk will NOT be broadcast live!  It will be taped only for internal UW CSE faculty use.\n\nFuture visual computing applications -- from photorealistic real-time rendering, to 4D light field cameras, to pervasive sensing and computer vision-demand orders of magnitude more computation than we currently have. From data centers to mobile devices, performance and energy scaling is limited by locality (the distance over which data has to move, e.g., from nearby caches, far away main memory, or across networks) and parallelism. Because of this, I argue that we should think of the performance and efficiency of an application as determined not just by the algorithm and the hardware on which it runs, but critically also by the organization of computations and data. For algorithms with the same complexity -- even the exact same set of arithmetic operations and data executing on the same hardware, the order and granularity of execution and placement of data can easily change performance by an order of magnitude because of locality and parallelism. To extract the full potential of our machines, we must treat the organization of computation as a first class concern while working across all levels from algorithms and data structures, to compilers, to hardware.\n\nThis talk will present facets of this philosophy in systems I have built for visual computing applications from image processing and vision, to 3D rendering, simulation, optimization, and 3D printing. I will show that, for data-parallel pipelines common in graphics, imaging, and other data-intensive applications, the organization of computations and data for a given algorithm is constrained by a fundamental tension between parallelism, locality, and redundant computation of shared values. I will focus particularly on the Halide language and compiler for image processing, which explicitly separates what computations define an algorithm from the choices of organization which determine parallelism, locality, memory footprint, and synchronization. I will show how this approach can enable much simpler programs to deliver performance often many times faster than the best prior hand-tuned C, assembly, and CUDA implementations, while scaling across radically different architectures, from ARM cores, to massively parallel GPUs, to FPGAs and custom ASICs.\n\nBio\n\nJonathan Ragan-Kelley is a postdoc in computer science at Stanford. He works on high-efficiency visual computing, including systems, compilers, and architectures for image processing, vision, 3D rendering, 3D printing, physical simulation, and scientific computing. He earned his PhD in Computer Science at MIT in 2014, where he built the Halide language for high-performance image processing. Halide is now used throughout industry to deploy code to hundreds of millions of smartphones and process tens of billions of images per day. Jonathan previously built the Lightspeed preview system, which was used on over a dozen films at Industrial Light & Magic and was a finalist for an Academy Technical Achievement Award. He has worked in GPU architecture, compilers, and research at NVIDIA, Intel, and ATI.", "Time": "2016-03-31 15:30:00", "URL": "http://www.cs.washington.edu/htbin-post/mvis/mvis?ID=2858", "University": "University of Washington", "Tags": "", "Venue": "EEB-105"}, {"Topic": "TBD", "Speaker": " TBD (TBD)", "Description": "TBD", "Time": "2016-04-04 15:30:00", "URL": "http://www.cs.washington.edu/htbin-post/mvis/mvis?ID=2879", "University": "University of Washington", "Tags": "", "Venue": "Gates Commons, CSE 691 Paul G Allen Center for Computer Science & Engineering"}, {"Topic": "Less Talking, More Learning: Avoiding Coordination In Parallel Machine Learning Algorithms", "Speaker": "Dimitris Papailiopoulos (University of Texas, Austin/UC Berkeley)", "Description": "The recent success of machine learning (ML) in both science and industry has generated an increasing demand to support ML algorithms at scale. In this talk, I will discuss strategies to gracefully scale machine learning on modern parallel computational platforms. A common approach to such scaling is coordination-free parallel algorithms, where individual processors run independently without communication, thus maximizing the time they compute. However, analyzing the performance of these algorithms can be challenging, as they often introduce race conditions and synchronization problems.\n\nIn this talk, I will introduce a general methodology for analyzing asynchronous parallel algorithms. The key idea is to model the effects of core asynchrony as noise in the algorithmic input.  This allows us to understand the performance of several popular asynchronous machine learning approaches, and to determine when asynchrony effects might overwhelm them.  To overcome these effects, I will propose a new framework for parallelizing ML algorithms, where all memory conflicts and race conditions can be completely avoided. I will discuss the implementation of these ideas in practice, and demonstrate that they outperform the state-of-the-art across a large number of ML tasks on gigabyte-scale data sets.\n\nBio\nDimitris Papailiopoulos is a postdoctoral researcher in the Department of Electrical Engineering and Computer Sciences at UC Berkeley and a member of the AMPLab. His research interests span machine learning, coding theory, and parallel and distributed algorithms, with a current focus on coordination-free parallel machine learning, large-scale data and graph analytics, and the use of codes to speed up distributed computation. Dimitris completed his Ph.D. in electrical and computer engineering at UT Austin in 2014. At Austin he worked under the supervision of Alex Dimakis. In 2015, he received the IEEE Signal Processing Society, Young Author Best Paper Award.", "Time": "2016-04-05 15:30:00", "URL": "http://www.cs.washington.edu/htbin-post/mvis/mvis?ID=2860", "University": "University of Washington", "Tags": "", "Venue": "EEB-105"}, {"Topic": "Program obfuscation: the power of unreadable code", "Speaker": "Nir Bitansky (Tel Aviv University/MIT)", "Description": "The purpose of obfuscation is to recompile programs in a way that preserves their functionality but otherwise renders their code unintelligible. Envisioned by Diffie and Hellman already in the 70's as a means of obtaining public-key encryption, it is known by now that this concept may have far reaching implications to cryptography and complexity theory. In particular, program obfuscation suggests (often exclusive) solutions to some of the most challenging privacy and security problems in the age of cloud computing and social networks.\n\nAt the same time, program obfuscation has turned out to be  an evasive goal to achieve, or to even meaningfully define. For a long time, solutions have been confined to heuristics, whereas attempts to achieve any sense of provable security have mostly led to impossibility results. This gloomy state dramatically changed in recent years, when it was shown that a relatively weak notion called indistinguishability obfuscation may be within reach (so far, based on strong computational assumptions) and still has the potential of realizing many dream applications.\n\nIn this talk, I will review the different aspects of obfuscation, including central notions, limitations, and feasibility. As a demonstration of the power of obfuscation, I will present a recent implication [Bitansky-Paneth-Rosen, FOCS15] that goes beyond cryptography into a fundamental problem in complexity and algorithmic game theory -- the hardness of finding a Nash equilibrium. I will conclude with the main open problems and challenges in the area of obfuscation.\n\nBio\nNir Bitansky is a postdoctoral associate at the cryptography group at MIT CSAIL. He earned his Ph.D. in computer science from Tel Aviv University in 2014. His research is centered around cryptography and its interplay with other areas of theoretical computer science.", "Time": "2016-04-07 15:30:00", "URL": "http://www.cs.washington.edu/htbin-post/mvis/mvis?ID=2865", "University": "University of Washington", "Tags": "", "Venue": "EEB-105"}, {"Topic": "Faster algorithms for fundamental convex problems and their applications in combinatorial optimization", "Speaker": "Yin Tat Lee (MIT)", "Description": "Convex optimization has been studied extensively and is a prominent tool in various areas such as combinatorial optimization, data analysis, operations research, and scientific computing.  Each field has developed specialized tools including data structures, sampling methods, and dimension reduction. In the past several years, I have been combining and improving the optimization techniques from different fields to design faster optimization algorithms. \n  \nIn this talk, I will discuss my work in this direction and illustrate it through my results on linear programming and general convex optimization. In particular, I will present a new algorithm for solving linear programs, which gives the first improvement to the running time for linear programming in 25 years. Then, I will present the first nearly cubic time algorithm for solving general convex optimization problems. Furthermore, I will discuss how these two results can be used to improve the running time of many classical combinatorial problems such as maximum flow and submodular function minimization.\n  \nThis talk will assume no prior knowledge of optimization.\n  \nBio: \nYin Tat Lee is a Ph.D. candidate in the department of mathematics at the Massachusetts Institute of Technology. He is interested in designing faster algorithms, particularly for problems in optimization. Since he began his Ph.D. in 2012, he has combined ideas from continuous and discrete mathematics to substantially advance the state-of-the-art for solving many fundamental problems in computer science, such as linear programming, maximum flow, and submodular function minimization. He has received a variety of awards, including the Best Student Paper Award at FOCS 2015, Best Paper Award at SODA 2014, Best Paper Award and Best Student Paper Award at FOCS 2014, and Notable Article in Computing in 2014 by Computing Reviews.", "Time": "2016-04-12 15:30:00", "URL": "http://www.cs.washington.edu/htbin-post/mvis/mvis?ID=2856", "University": "University of Washington", "Tags": "", "Venue": "EEB-105"}, {"Topic": "Control of agile robots in complex environments with formal safety guarantees", "Speaker": "Anirudha Majumdar (MIT)", "Description": "The goal of my research is to develop algorithmic and theoretical techniques that push highly agile robotic systems to the brink of their hardware limits while guaranteeing that they operate in a safe manner despite uncertainty in the environment and dynamics.\n  \nIn this talk, I will describe my work on algorithms for the synthesis of feedback controllers that come with associated formal guarantees on the stability of the robot and show how these controllers and certificates of stability can be used for robust planning in environments previously unseen by the system. In order to make these results possible, my work connects deeply to computational tools such as sums-of-squares (SOS) programming and semidefinite programming from the theory of mathematical optimization, along with approaches from nonlinear control theory.\n  \nI will describe this work in the context of the problem of high-speed unmanned aerial vehicle (UAV) flight through cluttered environments previously unseen by the robot. In this context, the tools I have developed allow us to guarantee that the robot will fly through its environment in a collision-free manner despite uncertainty in the dynamics (e.g., wind gusts or modeling errors). The resulting hardware demonstrations on a fixed-wing airplane constitute one of the first examples of provably safe and robust control for robotic systems with complex nonlinear dynamics that need to plan in realtime in environments with complex geometric constraints.\n  \nBio: \nAnirudha Majumdar is a Ph.D. candidate in the Electrical Engineering and Computer Science department at MIT. He is a member of the Robot Locomotion Group at the Computer Science and Artificial Intelligence Lab and is advised by Prof. Russ Tedrake. Ani received his undergraduate degree in Mechanical Engineering and Mathematics from the University of Pennsylvania, where he was a member of the GRASP lab. His research is primarily in robotics: he works on algorithms for controlling highly dynamics robots such as unmanned aerial vehicles with formal guarantees on the safety of the system. Ani's research has been recognized by the Siebel Foundation Scholarship and the Best Conference Paper Award at the International Conference on Robotics and Automation (ICRA) 2013.\n", "Time": "2016-04-14 15:30:00", "URL": "http://www.cs.washington.edu/htbin-post/mvis/mvis?ID=2874", "University": "University of Washington", "Tags": "", "Venue": "EEB-105"}, {"Topic": "Multiple Devices + Crowds = Richer User Interfaces", "Speaker": "Michael Nebeling (ETH Zurich/CMU)", "Description": "At present, user interfaces are typically created by designers for an idealized set of users and the most common interactive devices. In view of the growing number and diversity of new devices, it becomes increasingly difficult to design for the many possible input/output characteristics and contexts of use, and interfaces remain fairly limited in their ability to adapt to devices and their role in a user's larger task. In this talk, I will describe how my research in human-computer interaction blurs the boundaries of interactive technologies and enables user interfaces to seamlessly grow, with the help of users and crowds, to take advantage of many devices and use contexts that are poorly supported by current design. For example, W3Touch allows user interfaces to adapt to a large variety of touch devices based on user performance metrics and crowd data mining; XDBrowser customizes existing single-device web interfaces for multi-device use based on user-defined cross-device design patterns; and WearWrite allows a user to provide input and interact with a document using their smartwatch on one end of the interface, and a crowd of writers to perform actions on the user's behalf using larger and more powerful devices on the other end of the interface. I will outline a research agenda that has the goal of making user interface design itself natural, embedding human intelligence into interactive computing technologies, and supporting evidence-based design using large-scale interaction data.\n  \nBio: \nMichael Nebeling is a Swiss NSF Advanced Postdoc.Mobility Fellow and a Visiting Researcher in the Human-Computer Interaction Institute at Carnegie Mellon University hosted by Anind Dey. Before coming to CMU in 2015, he was a Senior Researcher and Lecturer at the Department of Computer Science at ETH Zurich, where he obtained his PhD in 2012. His research interests are at the intersection of human-computer interaction, user interface engineering, ubiquitous computing, and crowdsourcing. As part of his research, he has created many systems to support the design and evaluation of rich, context-aware and adaptive, cross-device, multi-touch and multi-modal gesture and speech interfaces, and has received six Best Paper Awards and Honorable Mentions at premier venues in human-computer interaction and engineering, including ACM CHI and ACM EICS. Michael is committed to promoting engineering research within the HCI community. He has been an Associate Chair for the CHI Technology, Systems and Engineering subcommittee for CHI 2014-2016. He was EICS 2015 Papers co-chair and EICS 2014 Late-Breaking Results co-chair. He is on the EICS steering committee and also a Senior PC member for EICS 2016.\n", "Time": "2016-04-19 15:30:00", "URL": "http://www.cs.washington.edu/htbin-post/mvis/mvis?ID=2863", "University": "University of Washington", "Tags": "", "Venue": "EEB-105"}, {"Topic": "Reviving General Purpose Computing with Architectural Specialization", "Speaker": "Tony Nowatzki (U Wisconsin, Madison)", "Description": "Improvements in the performance and energy consumption of general purpose processors have slowed dramatically over the last decade.  This is due to the combined effect of breakdowns in transistor scaling, causing severe chip-level power limitations, and monolithic and inefficient general purpose microarchitecture.\n  \nIn this work, I propose and evaluate a concept called \"behavioral specialization\", where the design of general purpose processors is modularized by adding programmable offload engines, each best-suited for different program behaviors or characteristics.  To explore this principle, I designed a modular general-purpose core which transparently improves performance and energy efficiency by integer factors. I also extend these principles to create an architecture for highly-regular and parallelizable workloads for a further order of magnitude improvements.\n  \nI have discovered that a small number of exploitable program behaviors can cover a majority of applications, that dataflow architectures become practical and useful in hybrid execution with a general purpose core, and that programmable architectures can be competitive with domain specific alternatives on well-behaved workloads, with only small area and negligible energy overheads.  Overall, behavioral specialization causes disruptive change in microprocessor tradeoffs, enabling mobile-class processor energy-efficiency with desktop-class performance.\n  \nBio: \nTony Nowatzki is a Ph.D. student in the Department of Computer Sciences at the University of Wisconsin-Madison advised by Karu Sankaralingam. His broad research interests include architecture and compiler codesign and mathematical modeling. He is recipient of a Google PhD Fellowship. His work has been recognized with a IEEE Micro Top Picks award, a PLDI Distinguished Paper Award, SIGARCH and SIGPLAN CACM Research Highlights nominations, and an IEEE Best of CAL award. He was the lead author on a Synthesis Lecture on \"Optimization and Mathematical Modeling in Computer Architecture.\"\n", "Time": "2016-04-21 15:30:00", "URL": "http://www.cs.washington.edu/htbin-post/mvis/mvis?ID=2875", "University": "University of Washington", "Tags": "", "Venue": "EEB-105"}, {"Topic": "TBD", "Speaker": "Julia Rubin (University of Toronto/MIT)", "Description": "TBD", "Time": "2016-04-26 15:30:00", "URL": "http://www.cs.washington.edu/htbin-post/mvis/mvis?ID=2862", "University": "University of Washington", "Tags": "", "Venue": "EEB-105"}, {"Topic": "Algorithms for Strategic Agents", "Speaker": "Matt Weinberg (MIT/Princeton)", "Description": "When real people interact with algorithms (e.g. in auctions, crowdsourcing, Bitcoin, etc.), they impose additional objectives beyond simply that the algorithm is correct, fast, and uses little storage. People strategize during these interactions, so algorithms deployed in these settings must be robust against potential manipulation. Additionally, people prefer transparent interactions, so these algorithms must also be as simple as possible. My research addresses these, and other novel challenges that arise when algorithms interact with strategic agents.\n  \nIn this talk, I will focus on one aspect of this agenda and present a new algorithmic framework to solve any optimization problem in a way that is robust to strategic manipulation. I will further apply this framework to extend Myerson's celebrated characterization of optimal single-item auctions to multiple items (Myerson 1981), design mechanisms for job scheduling (Nisan and Ronen 1999), and resolve other problems at the interface of algorithms and game theory.\n  \nFinally, I will briefly show how strategic considerations motivate nice questions in \"traditional\" areas of algorithm design as well, and present some of my work in online algorithms, convex optimization, and parallel algorithms.  \n  \nBio: \nMatt received his PhD in EECS from MIT in 2014, where he was advised by Costis Daskalakis. He is now a postdoc at Princeton University in the Computer Science department. His research focuses on designing algorithms that address constraints imposed by the strategic nature of agents that interact with them. For his thesis work on these topics, he received MIT's George M. Sprowls award and the SIGecom Doctoral Dissertation award. Matt received his B.A. in Math from Cornell University.", "Time": "2016-04-28 15:30:00", "URL": "http://www.cs.washington.edu/htbin-post/mvis/mvis?ID=2876", "University": "University of Washington", "Tags": "", "Venue": "EEB-105"}, {"Topic": "Fractional Derivatives and Their Applications", "Speaker": "Om Agrawal", "Description": "", "Time": "2016-01-27", "URL": "http://illinois.edu/emailer/newsletter/88105.html", "University": "UIUC", "Tags": "", "Venue": "NCSA Room 1040"}, {"Topic": "Particle Approaches for Modeling Multi-scale Nonequilibrium Flows", "Speaker": "Debbie Levin", "Description": "", "Time": "2016-02-10", "URL": "http://illinois.edu/emailer/newsletter/89351.html", "University": "UIUC", "Tags": "", "Venue": "NCSA Room 1040"}, {"Topic": "Elements of an Effective Sparse Solver", "Speaker": "Luke Olson", "Description": "", "Time": "2016-02-24", "URL": "http://illinois.edu/emailer/newsletter/89749.html", "University": "UIUC", "Tags": "", "Venue": "NCSA Room 1040"}, {"Topic": "Bridging the Gap between Continuum and Rarefied Non-equilibrium Flows: New Perspectives from Kinetic Methods and Theory", "Speaker": "Kelly Stephani", "Description": "", "Time": "2016-03-09", "URL": "http://illinois.edu/emailer/newsletter/91017.html", "University": "UIUC", "Tags": "", "Venue": "NCSA Room 1040"}, {"Topic": "Simulation of 3-D Hydraulic Fracture Propagation and Interactions Near a Wellbore", "Speaker": "Armando Duarte", "Description": "", "Time": "2016-04-06", "URL": "http://illinois.edu/emailer/newsletter/92833.html", "University": "UIUC", "Tags": "", "Venue": "NCSA Room 1040"}, {"Topic": "TBD", "Speaker": "Karthik Chandrasekaran", "Description": "", "Time": "2016-04-20", "URL": "http://illinois.edu/emailer/newsletter/93389.html", "University": "UIUC", "Tags": "", "Venue": "NCSA Room 1040"}, {"Topic": "Agnostic Linear Classification     ", "Speaker": "SHIVA KAUL    ", "Description": "Speaking Skills    \n  \n        \nSHIVA KAUL    \n  \n        \nPh.D. Student    \n  \n        \nComputer Science Department    \n  \n        \nCarnegie Mellon University    \n  \n        \nAgnostic Linear Classification     \n  \n        \nTuesday, April 12, 2016 - \n12:00pm to 1:00pm    \n  \n        \n3305     \n  \n        \nNewell-Simon Hall    \n  \n        \n\n\n[View Map]\n    \n  \n    Abstract:     \n\n\nWe introduce a simple new algorithm for improper, agnostic learning of halfspaces, a problem closely related to learning sparse parities with noise. It uses exponentially less data than previous algorithms, particularly ones based on fitting polynomials. It is provably correct in a wide range of settings, but not necessarily fast. The algorithm is very practical and achieves good experimental performance for both natural and artificial problems. The lynchpin of this algorithm is a new hypothesis class called smooth lists of halfspaces. They are more flexible than halfspaces, but do not require more data to train in the worst case. These new classifiers enable an iterative approach which is fundamentally different than update rules such as perceptron and multiplicative weights. Our analysis involves a dual interpretation of the algorithm as a dynamical system.\n\n\nJoint work with Geoff Gordon.\n\n\nPresented in Partial Fulfillment of the CSD Speaking Skills Requirement.\n    \n  \n        \nPoster    \n  \n    Keywords:     \nCSD    \n  \n    For More Information, Please Contact:     \n\n\n\ndeb [atsymbol] cs.cmu.edu", "Time": "2016-04-12 12:00:00-04:00", "URL": "https://www.scs.cmu.edu/calendar/tue-2016-04-12-1200/computer-science-speaking-skills-talk", "University": "Carnegie Mellon University", "Tags": "", "Venue": "Newell-Simon Hall"}, {"Topic": "Security Analytics: Bridging large-scale data collection and analysis  with human factors to design better defenses    ", "Speaker": "NICOLAS CHRISTIN    ", "Description": "Talks    \n  \n        \nNICOLAS CHRISTIN    \n  \n        \nAssistant Research Professor    \n  \n        \nDepartment of Electrical and Computer Engineering, and CyLab    \n  \n        \nCarnegie Mellon University    \n  \n        \nSecurity Analytics: Bridging large-scale data collection and analysis  with human factors to design better defenses    \n  \n        \nThursday, April 14, 2016 - 1:00pm    \n  \n        \nASA Conference Room 6115     \n  \n        \nGates&Hillman Centers    \n  \n        \n\n\n[View Map]\n    \n  \n    Abstract:     \n\n\nIn this talk, I will argue that understanding incentives of both attackers and targets has become critical to strengthening online security. I will advocate the need for an interdisciplinary research agenda, ranging from network measurements and large-scale data analysis to human factor modeling. Using case studies (online sale of unlicensed pharmaceutical drugs, and anonymous marketplaces), I will first describe how longitudinal, large-scale measurements and data analysis reveal important economic and structural properties of a priori complex criminal ecosystems. I will then discuss how these structural properties can be used to design successful interventions, both from a policy and from a technical angle.\n\n\nOn the policy side, I will show that our criminal ecosystem analysis evidences 'concentration points,' whose disruption could effectively hamper illicit operations. On the technical side, I will demonstrate how we can use adversaries' incentives to design and build systems that can proactively identify future attack targets. I will conclude by outlining a roadmap for security research combining measurements, mathematical modeling and behavioral aspects.\n\n\n—\n\n\nNicolas Christin is an Assistant Research Professor in Electrical and Computer Engineering at Carnegie Mellon University, where he has also affiliations with CyLab, the university-wide information security institute, the Information Networking Institute, the department of Engineering and Public Policy, and the Societal Computing doctoral program. He holds a Diplôme d'Ingénieur from École Centrale Lille, and M.S. and Ph.D. degrees in Computer Science from the University of Virginia.\n\n\nHe was a researcher in the School of Information at the University of California, Berkeley, prior to joining Carnegie Mellon in 2005. His research interests are in computer and information systems security; most of his work is at the boundary of systems and policy research. He has most recently focused on security analytics, online crime modeling, and economics and human aspects of computer security. His group's research won several awards including Honorable Mention at ACM CHI 2011 and 2016, and Best Student Paper Award at USENIX Security 2014.\n\n\nFaculty Host: Lorris Cranor\n    \n  \n        \nPoster    \n  \n    Keywords:     \nSCSFC    \n  \n    For More Information, Please Contact:     \n\n\n\nkhibner [atsymbol] cs.cmu.edu", "Time": "2016-04-14 13:00:00-04:00", "URL": "https://www.scs.cmu.edu/calendar/thu-2016-04-14-1300/scs-faculty-candidate-talk", "University": "Carnegie Mellon University", "Tags": "", "Venue": "Gates&Hillman Centers"}, {"Topic": "LinkedIn    ", "Speaker": "YI PAN    ", "Description": "Seminars    \n  \n        \nYI PAN    \n  \n        \nSoftware Engineer     \n  \n        \nLinkedIn    \n  \n        \nBuilding a Lambda-less Stream Processing System using Local States and Windowing    \n  \n        \nThursday, April 14, 2016 - \n12:00pm to 1:00pm    \n  \n        \nISTC Panther Hollow Conference Room, 4th Floor     \n  \n        \nRobert Mehrabian Collaborative Innovation Center    \n  \n        \n\n\n[View Map]\n    \n  \n    Abstract:     \n\n\nThis talk will provide an overview of LinkedIn's distributed stream processing platform, including Samza/Kafka/Databus. It will first cover the high level scenarios for stream processing in LinkedIn, followed by detailed requirements around scalability, re-processing, accuracy of results, and easy programmability; then we will focus on the requirements on stateful stream processing applications and explain how Samza's state management allows us to build applications meet all the above mentioned requirements. The key concepts, architecture and usage in LinkedIn's stream processing pipeline will be explained, including state management in Samza, the use and configuration of Kafka and Databus as input/output and as a change log.\n\n\nWe will also discuss in details how we leverage the reliable, repayable messaging system (i.e. Kafka) together w/ durable state management in Samza to build a Lambda-less stream processing platform. The key mechanism to achieve unified process model between batch and real-time stream is windowing. We will dive into the detailed requirements and our solutions to windowing a real-time stream in this talk as well.\n\n\n—\n\n\nYi Pan graduated from UCI with a Ph.D. in Computer Science in 2008. Since then, he has worked in distributed platforms for Internet applications for 8 years. He started in Yahoo! on Yahoo!'s NoSQL database project, leading the development of multiple features, such as real-time notification of database updates, secondary index, and live-migration from legacy systems to NoSQL database. Later, he joined and led the development of Cloud Messaging System, which is used heavily as a pub-sub service and transaction logs for distributed databases in Yahoo!. Since 2014, he joined LinkedIn and has quickly become the lead of Apache Samza team in LinkedIn, which provides scalable stream processing service for the whole company.\n\n\nFaculty Hosts: Majd Sakr, Garth Gibson\n\n\nPartially funded by Yahoo! Labs\n    \n  \n        \nPoster    \n  \n        \nEvent Website    \n  \n    Keywords:     \nSDI/ISTC    \n  \n    For More Information, Please Contact:     \n\n\n\nmsakr [atsymbol] cs.cmu.edukaren [atsymbol] ece.cmu.edu", "Time": "2016-04-14 12:00:00-04:00", "URL": "https://www.scs.cmu.edu/calendar/thu-2016-04-14-1200/sdiistc-seminar", "University": "Carnegie Mellon University", "Tags": "", "Venue": "Robert Mehrabian Collaborative Innovation Center"}, {"Topic": "Canonical Autocorrelation Analysis for Radiation Threat Detection    ", "Speaker": "MARIA DE ARTEAGA    ", "Description": "Project Presentations    \n  \n        \nMARIA DE ARTEAGA    \n  \n        \nPh.D. Student    \n  \n        \nJoint Ph.D. Program in Machine Learning and Public Policy    \n  \n        \nCarnegie Mellon University    \n  \n        \nCanonical Autocorrelation Analysis for Radiation Threat Detection    \n  \n        \nWednesday, April 20, 2016 - \n12:00pm to 1:30pm    \n  \n        \n2503     \n  \n        \nHamburg Hall    \n  \n        \n\n\n[View Map]\n    \n  \n    Abstract:     \n\n\nRadiation threat detection is an important security challenge for many countries. This paper introduces Canonical Autocorrelation Analysis (CAA), a method for finding multiple-to-multiple linear correlations within a single set of features. This can be useful when looking for hidden parsimonious structures in data, each involving only a small subset of all features. The discovered correlations are highly interpretable as they are formed by pairs of sparse linear combinations of the original features. In addition, this results in useful visualizations of data.\n\n\nIn this paper it is shown how CAA can be of use as a tool for anomaly detection when an expected structure of correlations is not followed by anomalous data. In the case of radiation threat detection, this allows characterization of harmless radiation data based on the patterns across bins of photon counts, and flagging of anomalies where they fail to follow such patterns. The resulting technique performs significantly better than an unsupervised alternative prevalent in the domain, while providing valuable additional insights for threat analysis.\n\n\nDAP Committee: Artur Dubrawski (Advisor) Daniel NagiSimon Labov (Lawrence Livermore National Laboratory)\n\n    \n  \n        \nPoster    \n  \n    Keywords:     \nDAP    \n  \n    For More Information, Please Contact:     \n\n\n\ndiane [atsymbol] cs.cmu.edu", "Time": "2016-04-20 12:00:00-04:00", "URL": "https://www.scs.cmu.edu/calendar/wed-2016-04-20-1200/joint-machine-learning-data-analysis-project-presentation-heinz-first-paper", "University": "Carnegie Mellon University", "Tags": "", "Venue": "Hamburg Hall"}, {"Topic": "MIT Sloan School of Management    ", "Speaker": "CATHERINE TUCKER    ", "Description": "Seminars    \n  \n        \nCATHERINE TUCKER    \n  \n        \nSloan Distinguished Professor of Management Science     \n  \n        \nand Professor of Marketing,     \n  \n        \nMIT Sloan School of Management    \n  \n        \nPrivacy Protection, Personalized Medicine and Genetic Testing    \n  \n        \nMonday, April 11, 2016 - \n12:00pm to 1:30pm    \n  \n        \n1502     \n  \n        \nHamburg Hall    \n  \n        \n\n\n[View Map]\n    \n  \n    Abstract:     \n\n\nThis paper explores how state genetic privacy laws affect the diffusion of personalized medicine, using data on genetic testing for cancer risks. State genetic privacy laws take three alternative approaches to protecting patient privacy: Requiring informed consent on the part of the individual; restricting discriminatory usage of genetic data by employers, health care providers or insurance companies; or limiting redisclosure without the consent of the individual or defining genetic data as the 'property' of the individual. We find empirically that approaches to genetic and health privacy that give users control over redisclosure encourage the spread of genetic testing, but that the informed consent approach deters individuals from obtaining genetic tests. We present some evidence that the latter reflects costs imposed on the supply of genetic testing by hospitals. We find no effects of state or federal genetic anti-discrimination laws on genetic testing rates.\n\n\n—\n\n\nCatherine Tucker is the Sloan Distinguished Professor of Management Science and Professor of Marketing at MIT Sloan. She is also Chair of the MIT Sloan PhD Program. Her research interests lie in how technology allows firms to use digital data to improve their operations and marketing, and in the challenges this poses for regulations designed to promote innovation. She has particular expertise in online advertising, digital health, social media, and electronic privacy. Generally, most of her research lies in the interface between marketing, economics, and law.\n    \n  \n        \nEvent Website    \n  \n    Keywords:     \nHeinz    \n  \n    For More Information, Please Contact:     \n\n\n\nCatherine Copetas, copetas [atsymbol] cs.cmu.edu", "Time": "2016-04-11 12:00:00-04:00", "URL": "https://www.scs.cmu.edu/calendar/mon-2016-04-11-1200/heinz-faculty-research-seminar", "University": "Carnegie Mellon University", "Tags": "", "Venue": "Hamburg Hall"}, {"Topic": "Automatically Generating Software Documentation from Existing Sources    ", "Speaker": "LAURA MORENO    ", "Description": "Talks    \n  \n        \nLAURA MORENO    \n  \n        \nPh.D. Candidate    \n  \n        \nDepartment of Computer Science    \n  \n        \nUniversity of Texas at Dallas    \n  \n        \nAutomatically Generating Software Documentation from Existing Sources    \n  \n        \nTuesday, April 12, 2016 - 10:00am    \n  \n        \nASA Conference Room 6115     \n  \n        \nGates&Hillman Centers    \n  \n        \n\n\n[View Map]\n    \n  \n    Abstract:     \n\n\nProgram comprehension is a fundamental activity during software maintenance and evolution, accounting for almost half of the resources invested in software change.  Together with the source code, software documentation is a critical resource when comprehending a software system.  Documentation, however, is far from ideal--more often than not, documentation is missing or it is outdated, it is difficult to access, and it lacks of standard format.\n\n\nThis talk will give an overview of my research on supporting developers during software (re)documentation through automatic summarization of various software artifacts. This work includes: the automatic summarization of classes in Object-Oriented systems, the automatic generation of release notes, and mining method API usage examples from existing software. The talk will primarily focus on the automatic generation of release notes, which are complex software artifacts that summarize the changes that occurred between two versions of a software system. I will discuss the different challenges of creating release notes and how my research work addressed them by integrating static code analysis, software summarization, and mining software repositories techniques. The empirical validation of the approach will also be presented. Finally, I will present future directions on the automatic software (re)documentation research.\n\n\n—\n\n\nLaura Moreno is a Ph.D. candidate at the University of Texas at Dallas, advised by Dr. Andrian Marcus.  Her research interest is in Software Engineering, with particular emphasis on Program Comprehension and Software Maintenance and Evolution.  The core of her research is empirical in nature and focuses on the development of tools, methodologies and practices that help software developers better understand and change large-scale software.  Her dissertation work, “Software Documentation through Summarization of Source Code Artifacts”, leverages information contained in various software artifacts and utilizes techniques from diverse fields, such as, natural language processing, data mining, software analysis, and information retrieval. \n\n\nPapers resulting from her research have been published in top software engineering venues, including the IEEE/ACM International Conference on Software Engineering (ICSE), the ACM/SIGSOFT Symposium on the Foundations of Software Engineering (FSE), the IEEE/ACM International Conference on Automated Software Engineering (ASE), and the IEEE International Conference on Software Maintenance and Evolution (ICSME). She has served as organizing committee member and program committee member for several conferences in the field.\n\n\nFaculty Host: Christian Kästner\n    \n  \n        \nPoster1    \n  \n    Keywords:     \nSCSFC    \n  \n    For More Information, Please Contact:     \n\n\n\nkhibner [atsymbol] cs.cmu.edu", "Time": "2016-04-12 10:00:00-04:00", "URL": "https://www.scs.cmu.edu/calendar/tue-2016-04-12-1000/scs-faculty-candidate-talk", "University": "Carnegie Mellon University", "Tags": "", "Venue": "Gates&Hillman Centers"}, {"Topic": "Reconstruction and Understanding of Indoor Environments    ", "Speaker": "MATTHIAS NIESSNER    ", "Description": "Seminars    \n  \n        \nMATTHIAS NIESSNER    \n  \n        \nVisiting Assistant Professor    \n  \n        \nStanford University    \n  \n        \nReconstruction and Understanding of Indoor Environments    \n  \n        \nMonday, April 18, 2016 - \n3:00pm to 4:00pm    \n  \n        \n1507     \n  \n        \nNewell-Simon Hall    \n  \n        \n\n\n[View Map]\n    \n  \n    Abstract:     \n\n\nIn recent years, commodity 3D sensors, such as the Microsoft Kinect, have become easily and widely available. These advances in sensing technology have inspired significant interest in using the captured data for mapping and understanding 3D environments. In this talk, I will present our current research in this fascinating field, show potential future research directions, and talk about long-term goals. More specifically, I will show how we can now easily obtain a 3D reconstruction of an environment, and how we can exploit these results in order to infer semantics of a scene.\n\n\n—\n\n\nMatthias Niessner is a visiting assistant professor at Stanford University. Previous to his appointment at Stanford, he earned his PhD from the University of Erlangen-Nuremberg, Germany under the supervision of Günther Greiner. His research focuses on different fields of computer graphics and computer vision, including the reconstruction and semantic understanding of 3D scene environments. Additional information.\n\n\nSponsored in part by Disney Research.\n    \n  \n        \nPoster    \n  \n        \nEvent Website    \n  \n    Keywords:     \nVASC    \n  \n    For More Information, Please Contact:     \n\n\n\ncdowney [atsymbol] andrew.cmu.edu", "Time": "2016-04-18 15:00:00-04:00", "URL": "https://www.scs.cmu.edu/calendar/mon-2016-04-18-1500/vision-and-autonomous-systems-center-seminar", "University": "Carnegie Mellon University", "Tags": "", "Venue": "Newell-Simon Hall"}, {"Topic": "Towards Understanding Stories from Videos    ", "Speaker": "SANJA FIDLER    ", "Description": "Seminars    \n  \n        \nSANJA FIDLER    \n  \n        \nAssistant Professor    \n  \n        \nDepartment of Computer Science    \n  \n        \nUniversity of Toronto    \n  \n        \nTowards Understanding Stories from Videos    \n  \n        \nTuesday, April 19, 2016 - \n3:00pm to 4:00pm    \n  \n        \n1507     \n  \n        \nNewell-Simon Hall    \n  \n        \n\n\n[View Map]\n    \n  \n    Abstract:     \n\n\nA successful autonomous system needs to not only understand the visual world but also communicate its understanding with humans. To make this possible, language can serve as a natural link between high level semantic concepts and low level visual perception. In this talk, I'll present our recent work in the interdisciplinary domain of vision and language. I’ll show how we can exploit the alignment between movies and books in order to build more descriptive captioning systems. I’ll also discuss our efforts towards automatic understanding of stories behind long and complex videos.\n\n\n—\n\n\nSanja Fidler is an Assistant Professor at the Department of Computer Science, University of Toronto.  Previously she was a Research Assistant Professor at TTI-Chicago, a philanthropically endowed academic institute located in the campus of the University of Chicago. She was a postdoctoral fellow at University of Toronto during 2011-2012. She completed her PhD in computer science at University of Ljubljana in 2010, and was a visiting student at UC Berkeley in the final year of her PhD. She is serving as an Area Chair in the upcoming CVPR’16, EMNLP’16 and ACCV’16, and as a Program Chair of 3DV’16. Her main research interests are object recognition, 3D scene understanding, and combining vision and language.\n\n\nSponsored in part by Disney Research.\n    \n  \n        \nPoster    \n  \n        \nEvent Website    \n  \n    Keywords:     \nVASC    \n  \n    For More Information, Please Contact:     \n\n\n\ncdowney [atsymbol] andrew.cmu.edu", "Time": "2016-04-19 15:00:00-04:00", "URL": "https://www.scs.cmu.edu/calendar/tue-2016-04-19-1500/vision-and-autonomous-systems-center-seminar", "University": "Carnegie Mellon University", "Tags": "", "Venue": "Newell-Simon Hall"}, {"Topic": "Finding Gender-Inclusiveness Software Issues in the Real World with GenderMag    ", "Speaker": "MARGARET BURNETT    ", "Description": "Seminars    \n  \n        \nMARGARET BURNETT    \n  \n        \nDistinguished Professor    \n  \n        \nSchool of Electrical Engineering and Computer Science    \n  \n        \nOregon State University    \n  \n        \nFinding Gender-Inclusiveness Software Issues in the Real World with GenderMag    \n  \n        \nTuesday, April 12, 2016 - \n1:00pm to 2:00pm    \n  \n        \nReddy Conference Room 4405     \n  \n        \nGates&Hillman Centers    \n  \n        \n\n\n[View Map]\n    \n  \n    Abstract:     \n\n\nGender inclusiveness in computing settings is receiving a lot of attention, but one potentially critical factor has mostly been overlooked: software itself. To help close this gap, we recently created GenderMag, a systematic inspection method to enable software practitioners to evaluate their software for issues of gender-inclusiveness. In this talk, we present the first real-world investigation of software practitioners' ability to identify gender-inclusiveness issues in software they create/maintain using this method. Our investigation was a multiple-case field study of software teams at three major U.S. technology organizations. The results were that, using GenderMag to evaluate software, these software practitioners identified a surprisingly high number of gender-inclusiveness issues: 25% of the software features they evaluated had gender-inclusiveness issues. We present these results and more, along with tales from the trenches on what it’s like to use GenderMag, where the pitfalls lie, and all the things we are still in the process of learning about it.\n\n\n—\n\n\nMargaret Burnett is an OSU Distinguished Professor at Oregon State University.  She began her career in industry, where she was the first woman software developer ever hired at Procter & Gamble Ivorydale.  A few degrees and start-ups later, she joined academia, with a research focus on people who are engaged in some form of software development.  She  leads the team that created GenderMag, a software inspection process that uncovers gender inclusiveness issues in software from spreadsheets to programming environments.  Burnett is an ACM Distinguished Scientist and a member of the ACM CHI Academy.  She current serves on three editorial boards, on several conference committees, and on the  Academic Alliance Advisory Board of the National Center for Women in IT (NCWIT). >\n    \n  \n        \nPoster    \n  \n        \nEvent Website    \n  \n    Keywords:     \nHCII    \n  \n    For More Information, Please Contact:     \n\n\n\njpuglisi [atsymbol] cs.cmu.edu", "Time": "2016-04-12 13:00:00-04:00", "URL": "https://www.scs.cmu.edu/calendar/tue-2016-04-12-1300/special-human-computer-interaction-institute-seminar", "University": "Carnegie Mellon University", "Tags": "", "Venue": "Gates&Hillman Centers"}, {"Topic": "Supervision Beyond Manual Annotations for Learning Visual Representations    ", "Speaker": "CARL DOERSCH    ", "Description": "Thesis Orals    \n  \n        \nCARL DOERSCH    \n  \n        \nPh.D. Student    \n  \n        \nMachine Learning Department    \n  \n        \nCarnegie Mellon University    \n  \n        \nSupervision Beyond Manual Annotations for Learning Visual Representations    \n  \n        \nFriday, April 15, 2016 - 1:00pm    \n  \n        \n1507     \n  \n        \nNewell-Simon Hall    \n  \n        \n\n\n[View Map]\n    \n  \n    Abstract:     \n\n\nFor both humans and machines, understanding the visual world requires relating new percepts with past experience. We argue that a good visual representation for an image should encode what makes it similar to other images, enabling the recall of associated experiences. Current machine implementations of visual representations can capture some aspects of similarity, but fall far short of human ability overall. Even if one explicitly labels objects in millions of images to tell the computer what should be considered similar—a very expensive procedure—the labels still do not capture everything that might be relevant.\n\n\nThis thesis shows that one can often train a representation which captures similarity beyond what is labeled in a given dataset. That means we can begin with a dataset that has uninteresting labels, or even one without labels, and still build a useful representation. To do this, we propose to using pretext tasks: tasks that are not useful in and of themselves, but serve as an excuse to learn a more general-purpose representation. The labels for a pretext task can be inexpensive or even free. Furthermore, since this approach assumes training labels differ from the desired outputs, it can handle output spaces where the correct answer is ambiguous, and therefore impossible to annotate by hand.\n\n\nThe thesis explores two broad classes of supervision. The first is weak image-level supervision, which is exploited to train mid-level discriminative patch classifiers. For example, given a dataset of street-level imagery labeled only with GPS coordinates, patch classifiers are trained to differentiate one specific geographical region (e.g. the city of Paris) from others. The resulting classifiers each automatically collect and associate a set of patches which all depict the same distinctive architectural element. In this way, we can learn to detect elements like balconies, signs, and lamps without annotations. The second type of supervision requires no information about images other than the pixels themselves. Instead, the algorithm is trained to predict the context around image patches. The context serves as a sort of weak label: to predict well, the algorithm must associate similar-looking patches which also have similar contexts. After training, the feature representation learned using this within-image context indeed captures visual similarity across images, which ultimately makes it useful for real tasks like object detection and geometry estimation.\n\n\nThesis Committee:Alexei A. Efros (Co-chair, UC Berkeley)Abhinav Gupta (Co-chair)Ruslan Salakhutdinov (University of Toronto)Trevor Darrell (UC Berkeley)\n    \n  \n        \nPoster    \n  \n    Keywords:     \nMLD    \n  \n    For More Information, Please Contact:     \n\n\n\ndiane [atsymbol] cs.cmu.edu", "Time": "2016-04-15 13:00:00-04:00", "URL": "https://www.scs.cmu.edu/calendar/fri-2016-04-15-1300/machine-learning-thesis-defense", "University": "Carnegie Mellon University", "Tags": "", "Venue": "Newell-Simon Hall"}, {"Topic": "and Head, Computational Learning for Autonomous Systems    ", "Speaker": "GERHARD NEUMANNN    ", "Description": "Talks    \n  \n        \nGERHARD NEUMANNN    \n  \n        \nAssistant Professor    \n  \n        \nand Head, Computational Learning for Autonomous Systems    \n  \n        \nTechnische Universität Darmstadt    \n  \n        \n   Learning Motor Skills: Novel Probabilistic Approaches to  Movement Generation and Continuous Decision Making    \n  \n        \nMonday, April 11, 2016 - 10:00am    \n  \n        \nASA Conference Room 6115     \n  \n        \nGates&Hillman Centers    \n  \n        \n\n\n[View Map]\n    \n  \n    Abstract:     \n\n\nRobotics is currently moving from repeating a few deterministic tasks a million times to learning millions of tasks, repeated just a few times in typically stochastic environments. This paradigm shift requires rethinking robot learning algorithms as all decision making processes are thus based on uncertain, incomplete observations obtained from high-dimensional sensory in-put.\n\n\nThus, data-driven action generation can no longer rely on simply reproducing good trajectories but rather has to take the un-certainty on demonstrated and experienced movements into account. Using these insights, I will present probabilistic approaches to the representation, execution and learning of movement policies. Central to these approaches is a new skill representation called probabilistic movement primitives (ProMP) that allow capturing the variability and inherent correlations essential to a better generalization of the task from few examples. With such ProMPs, difficult robot learning problems can be treated in a principled manner. For example, coupling of movements to selected perceptual input and prioritized concurrent execution of movements can be achieved using classical operators from probability theory.\n\n\nWhile the resulting probabilistic policies naturally enable learning from demonstrations, they can-not automatically address the exploration-exploitation dilemma. I will show that new class of reinforcement algorithms arises from information theoretic insights by bounding both the loss of in-formation and entropy during the policy updates in reward-related self-improvement. The resulting methods have been used to improve single stroke movements and learn complex non-parametric policies in hierarchical reinforcement learning problems.", "Time": "2016-04-11 10:00:00-04:00", "URL": "https://www.scs.cmu.edu/calendar/mon-2016-04-11-1000/scs-faculty-candidate-talk", "University": "Carnegie Mellon University", "Tags": "", "Venue": "Gates&Hillman Centers"}, {"Topic": "First-Person Vision    ", "Speaker": "KRIS KITANI    ", "Description": "Talks    \n  \n        \nKRIS KITANI    \n  \n        \nSystems Scientist    \n  \n        \nRobotics Institute    \n  \n        \nCarnegie Mellon University    \n  \n        \nFirst-Person Vision    \n  \n        \nWednesday, April 13, 2016 - 10:00am    \n  \n        \nASA Conference Room 6115     \n  \n        \nGates&Hillman Centers    \n  \n        \n\n\n[View Map]\n    \n  \n    Abstract:     \n\n\nThe number of wearable cameras will account for nearly 1/3 of the consumer camera market in a few years. As a result, there has been an increasing interest in the application of computer vision technology to videos recorded by wearable cameras, also called first-person vision. In my talk, I will give a review of the state-of-the-art in this re-emerging area of research and describe my vision for research in the area of first-person vision. Specifically, I will describe how the first-person point-of-view can be used to help computers understand how people (1) interact with the environment and (2) interact with other people. The presented work will show how the wearable nature of the camera allows for detailed analysis of hand use and the subtleties of social interactions. Furthermore, I will give an example of how the mobile nature of the camera can be used to understand the functionality of large physical spaces to enable large-scale scene understanding. Finally, I will describe how the technologies developed through my work can be integrated into several assistive applications such as navigation for the blind and post-stroke rehabilitation.\n\n\n—\n\n\nKris Kitani is a Systems Scientist in the Robotics Institute at Carnegie Mellon University. He specializes in the area of human activity understanding from video. His work on learning actions from video was awarded the Best Paper Award at the Meeting on Image Recognition and Understanding (MIRU) 2008, the largest computer vision conference in Japan, and the Best Journal Paper Award from the Institute of Electronics, Information and Communications Engineers (IEICE) in 2010. His work on activity forecasting was awarded the Best Paper Honorable Mention Award at the European Conference on Computer Vision (ECCV) in 2012. He is currently an Associate Editor of the IEEE THMS journal special issue on Wearable and Ego-vision Systems for Augmented Experience and has organized several workshops on Egocentric (First-Person) Vision at CVPR. His work has been featured in the popular press such as the Wall Street Journal, Washington Post and ABC news.\n    \n  \n        \nPoster    \n  \n    Keywords:     \nSCSFC    \n  \n    For More Information, Please Contact:     \n\n\n\nkhibner [atsymbol] cs.cmu.edu", "Time": "2016-04-13 10:00:00-04:00", "URL": "https://www.scs.cmu.edu/calendar/wed-2016-04-13-1000/scs-faculty-candidate-talk", "University": "Carnegie Mellon University", "Tags": "", "Venue": "Gates&Hillman Centers"}, {"Topic": "Monitoring and Blame Assignment for Higher-Order Session Types     ", "Speaker": "HANNAH GOMMERSTADT    ", "Description": "Speaking Skills    \n  \n        \nHANNAH GOMMERSTADT    \n  \n        \nPh.D. Student    \n  \n        \nComputer Science Department    \n  \n        \nCarnegie Mellon University    \n  \n        \nMonitoring and Blame Assignment for Higher-Order Session Types     \n  \n        \nFriday, April 22, 2016 - \n12:00pm to 1:00pm    \n  \n        \nTraffic 21 Classroom 6501     \n  \n        \nGates&Hillman Centers    \n  \n        \n\n\n[View Map]\n    \n  \n    Abstract:     \n\n\nIn a distributed setting, processes collaborate to complete tasks where each component of the system has some role in the computation. These processes may be written in different languages, and some may be compromised by an attacker. We use session types, types that change as every step of the computation is performed, to prescribe the communication behavior between concurrent message-passing processes. We then use these session types to dynamically monitor the communication between processes to detect undesirable behavior. In this talk, we discuss how to dynamically monitor communication to enforce adherence to session types in a higher-order setting. We present a system of blame assignment in the case when the monitor detects an undesirable action and an alarm is raised. \n\n\nJoint work with Frank Pfenning and Limin Jia. \n\n\nPresented in Partial Fulfillment of the CSD Speaking Skills Requirement. \n    \n  \n        \nPoster    \n  \n    Keywords:     \nSCSDay    \n  \n    For More Information, Please Contact:     \n\n\n\ndeb [atsymbol] cs.cmu.edu", "Time": "2016-04-22 12:00:00-04:00", "URL": "https://www.scs.cmu.edu/calendar/fri-2016-04-22-1200/computer-science-speaking-skills-talk", "University": "Carnegie Mellon University", "Tags": "", "Venue": "Gates&Hillman Centers"}, {"Topic": "Influenza Trend Prediction Using Kalman Filters and Particle Filters    ", "Speaker": "YING ZHANG    ", "Description": "Project Presentations    \n  \n        \nYING ZHANG    \n  \n        \nSecondary Masters Student    \n  \n        \nMachine Learning Department    \n  \n        \nCarnegie Mellon University    \n  \n        \nInfluenza Trend Prediction Using Kalman Filters and Particle Filters    \n  \n        \nFriday, April 8, 2016 - 5:00pm    \n  \n        \n8102     \n  \n        \nGates&Hillman Centers    \n  \n        \n\n\n[View Map]\n    \n  \n    Abstract:     \n\n\nSeasonal influenza can cause severe health problems and significant economic burdens in various regions of the world. Forecasting the influenza trends is crucial in developing effective countermeasures to mitigate an epidemic outbreak. The Centers for Disease Control and Prevention collected several indicators of influenza-like illness (ILI) through its surveillance network. Furthermore, the high correlation of web data of Twitter messages and Wikipedia article access with the ILI data allows the robust prediction of influenza when ILI data is delayed in the surveillance network. Filtering techniques (Kalman filters and particle filters) are known to provide better estimates of a dynamic system based on the measurements from the past to the current time through a recursive Bayesian update.\n\n\nWe implemented several filtering methods for a synthetic data set, which is generated using an epidemic propagation model with added noise. This synthetic data set allows a quantitative evaluation of log likelihood and mean square error for the filtering methods. We then examined the extended Kalman filter and particle filter in modeling the real influenza data (ILI data, Wikipedia and twitter signals). The filtering methods demonstrate fine performance in predicting peak time of infectious population in both the synthetic data and real influenza data. The peaks estimated from the filter methods are approximately one to two weeks delayed from the true occurrence time of influenza peak. This delay in estimation may be unavoidable as filter methods are mainly based on the past data.\n\n\nDAP Committee: Roni Rosenfeld, Ryan Tibshirani, Roy Maxion\n    \n  \n    Keywords:     \nMLD    \n  \n    For More Information, Please Contact:     \n\n\n\ndiane [atsymbol] cs.cmu.edu", "Time": "2016-04-08 17:00:00-04:00", "URL": "https://www.scs.cmu.edu/calendar/fri-2016-04-08-1700/machine-learning-data-analysis-project-presentation-v", "University": "Carnegie Mellon University", "Tags": "", "Venue": "Gates&Hillman Centers"}, {"Topic": "Scene Recognition with Deep Learning    ", "Speaker": "WEI DAI    ", "Description": "Project Presentations    \n  \n        \nWEI DAI    \n  \n        \nPh.D. Student    \n  \n        \nMachine Learning Department    \n  \n        \nCarnegie Mellon University    \n  \n        \nScene Recognition with Deep Learning    \n  \n        \nFriday, April 8, 2016 - 3:00pm    \n  \n        \n8102     \n  \n        \nGates&Hillman Centers    \n  \n        \n\n\n[View Map]\n    \n  \n    Abstract:     \n\n\nSound is an important modality for perceiving the the environment, complementing visual inputs, with the benefit that sound can be more easily collected and stored. Increasingly machines in various environment can hear, such as smartphones, wearables, and security systems. This work applies state-of-art deep learning models to understanding environmental sounds. Using the dataset from the ongoing IEEE challenge on Detection and Classification of Acoustic Scenes and Events (DCASE) which includes 15 diverse indoor and outdoor environments, we study 5 deep learning models and 2 popular traditional acoustic models on 4 feature representations.  We find that deep models compare favorably with traditional models, and, perhaps surprisingly, temporal models do not out-perform multi-layer perception, suggesting that environmental sounds don’t necessarily exhibit strong temporal dynamics.  Our best-performing model achieves 80% test accuracy, outperforming the official baseline of the contest by 13%.\n\n\nDAP Committee: Eric Xing, William Cohen, Roy Maxion\n    \n  \n    Keywords:     \nMLD    \n  \n    For More Information, Please Contact:     \n\n\n\ndiane [atsymbol] cs.cmu.edu", "Time": "2016-04-08 15:00:00-04:00", "URL": "https://www.scs.cmu.edu/calendar/fri-2016-04-08-1500/machine-learning-data-analysis-project-presentation-iv", "University": "Carnegie Mellon University", "Tags": "", "Venue": "Gates&Hillman Centers"}, {"Topic": "Linear Time Samplers for Supervised Topic Models using Compositional Proposals    ", "Speaker": "XUN ZHENG    ", "Description": "Project Presentations    \n  \n        \nXUN ZHENG    \n  \n        \nMasters Student    \n  \n        \nMachine Learning Department    \n  \n        \nCarnegie Mellon University    \n  \n        \nLinear Time Samplers for Supervised Topic Models using Compositional Proposals    \n  \n        \nFriday, April 8, 2016 - 2:00pm    \n  \n        \n8102     \n  \n        \nGates&Hillman Centers    \n  \n        \n\n\n[View Map]\n    \n  \n    Abstract:     \n\n\nTopic models are effective probabilistic tools for processing large collections of unstructured data. With the exponential growth of modern industrial scale data and the ambition to capture more refined hidden information through exploring bigger models, topic models face the significant scalability challenge which lots of previous work has been devoted to addressing, culminating in the recent fast Markov chain Monte Carlo sampling algorithms in Li et al. (2014); Yuan et al. (2015) for the unsupervised latent Dirichlet allocation (LDA) formulations.\n\n\nIn this work we extend the recent sampling advances for unsupervised LDA models to supervised tasks. We focus on the MedLDA model Zhu et al. (2013b) that is able to simultaneously discover latent structures and make accurate predictions. Through innovative combinations of a set of sampling techniques such as mixtures of MCMC kernels, we are able to reduce the O(K^3 + DK^2) complexity in Zhu et al. (2013b) to O(DK) when there are K topics and D documents. In our experiments with 20 newsgroups and labeled Wikipedia dataset, we show that the new algorithm is able to learn the latent structure of text data more efficiently, opening up possibilities for real-time text analytics and prediction.\n\n\nDAP Committee: Eric Xing, Roy Maxion\n    \n  \n    Keywords:     \nMLD    \n  \n    For More Information, Please Contact:     \n\n\n\ndiane [atsymbol] cs.cmu.edu", "Time": "2016-04-08 14:00:00-04:00", "URL": "https://www.scs.cmu.edu/calendar/fri-2016-04-08-1400/machine-learning-data-analysis-project-presentation-iii", "University": "Carnegie Mellon University", "Tags": "", "Venue": "Gates&Hillman Centers"}, {"Topic": "Identifying Influential Users in Social Network with Review Data    ", "Speaker": "YILIN HE    ", "Description": "Project Presentations    \n  \n        \nYILIN HE    \n  \n        \nSecondary Masters Student    \n  \n        \nMachine Learning Department    \n  \n        \nCarnegie Mellon University    \n  \n        \nIdentifying Influential Users in Social Network with Review Data    \n  \n        \nFriday, April 8, 2016 - 12:30pm    \n  \n        \n8102     \n  \n        \nGates&Hillman Centers    \n  \n        \n\n\n[View Map]\n    \n  \n    Abstract:     \n\n\nSocial networks have been widely utilized by a variety of popular review websites, and different users have a different impact on how information propagates through the network. Identifying influential users in such system could be beneficial for advertising purposes. In this paper, we analyzed a Yelp dataset and identified such users by estimating the influence propagation probability between social ties in the network using review data which contains rating and temporal information. The convex network inference model is adopted and applied with prior knowledge of the social network.  We then proposed a method combining the two modifications on top of this method: the self-exploring model which supports user's information discovery without knowledge propagation; the rating model which incorporated rating data. Our analysis showed that this model has good performance in identifying influential users in the network while being able to tolerate attacks on the social network without a severe impact on the result.  \n\n\nDAP Committee: Eric Xing, Roy Maxion\n    \n  \n    Keywords:     \nMLD    \n  \n    For More Information, Please Contact:     \n\n\n\ndiane [atsymbol] cs.cmu.edu", "Time": "2016-04-08 12:30:00-04:00", "URL": "https://www.scs.cmu.edu/calendar/fri-2016-04-08-1230/machine-learning-data-analysis-project-presentation-ii", "University": "Carnegie Mellon University", "Tags": "", "Venue": "Gates&Hillman Centers"}, {"Topic": "Functional Linear Models for Brain Data    ", "Speaker": "JUNIER OLIVA    ", "Description": "Project Presentations    \n  \n        \nJUNIER OLIVA    \n  \n        \nPh.D. Student    \n  \n        \nMachine Learning Department    \n  \n        \nCarnegie Mellon University    \n  \n        \nFunctional Linear Models for Brain Data    \n  \n        \nFriday, April 8, 2016 - 9:30am    \n  \n        \n8102     \n  \n        \nGates&Hillman Centers    \n  \n        \n\n\n[View Map]\n    \n  \n    Abstract:     \n\n\nModern neuroimaging data has provided a much needed window into the intricacies of the human brain. Neuroimaging techniques such as functional magnetic resonance imaging (fMRI), magnetoencephalography (MEG), and diffusion tensor imaging (DTI), often contain many thousands of functional observations per subject. While some success has been had using heuristical summary statistics of neuroimaging functional observations to build predictive models, there is a lack of a flexible and principled framework to build models from neuroimaging techniques.\n\n\nAim. Our aim is to develop a general, principled framework for supervised learning that scales to many thousands of neuroimaging functional observations per subject without resorting to heuristical summary statistics. In particular, we look to regress a subject’s age given neuroimaging data.\n\n\nData. Diffusion MR images were acquired from a total of 90 subjects. The subjects ranged in age from 13 to 60 years old, and included 45 males and 45 females. The subjects had no known history of neurological or mental disorder. We used per-voxel functional covariates of diffusion orientation distribution functions (dODFs) in our models and real-valued fractional anisotropy (FA) covariates as a baseline. dODFs are functions that represent the amount of water molecules, or spins, undergoing diffusion indifferent orientations over the S 2 sphere. FA values are the peak of the dODF and have previously been used as a summary statistic of dODFs for age regression. In total, 25K voxels were considered in a shared template-space.\n\n\nMethods. We develop and empirically test linear functional models for neuroimaging data. We use a model that represents neuroimaging functional observations nonparametrically using orthonormal basis projections. The age response is modeled as a sparse additive linear combination of inner products. We show that our model may be optimized using a group-LASSO approach.\n\n\nResults. Our functional sparse linear model was able to predict age with a 29.15% lower MSE than previous heuristic-based methods. Results were found to be statistically significant with a p-value of 0.04 using a paired t-test. Conclusions. In this work we have developed and tested a principled framework for building predictive supervised models with functional neuroimaging data. This framework allows one to use functional neuro-data in a statistically principled fashion without resorting to heuristical summary statistics.\n\n\nDAP Committee: Barnabas Poczos, Jeff Schneider, Roy Maxion   \n    \n  \n    Keywords:     \nMLD    \n  \n    For More Information, Please Contact:     \n\n\n\ndiane [atsymbol] cs.cmu.edu", "Time": "2016-04-08 09:30:00-04:00", "URL": "https://www.scs.cmu.edu/calendar/fri-2016-04-08-0930/machine-learning-data-analysis-project-presentation-i", "University": "Carnegie Mellon University", "Tags": "", "Venue": "Gates&Hillman Centers"}, {"Topic": "Learning Multimodal Deep Models    ", "Speaker": " RUSLAN SALAKHUTDINOV    ", "Description": "Colloquium    \n  \n        \n RUSLAN SALAKHUTDINOV    \n  \n        \nAssistant Professor    \n  \n        \nDepartments of Statistics and Computer Science    \n  \n        \nUniversity of Toronto    \n  \n        \nLearning Multimodal Deep Models    \n  \n        \nFriday, April 8, 2016 - \n2:30pm to 3:45pm    \n  \n        \nRashid Auditorium 4401     \n  \n        \nGates&Hillman Centers    \n  \n        \n\n\n[View Map]\n    \n  \n    Abstract:     \n\n\nBuilding intelligent systems that are capable of extracting meaningful representations from high-dimensional data lies at the core of solving many AI related tasks, including visual object recognition, information retrieval, speech perception, and language understanding.\n\n\nIn this talk I will first introduce a broad class of deep learning models and show that they can learn useful hierarchical representations from large volumes of high-dimensional data with applications in information retrieval, object recognition, and speech perception. I will discuss deep models that are capable of extracting a unified representation that fuses together multiple data modalities. In particular, I will introduce models that can generate natural language descriptions (captions) of images, as well as generate images from captions using attention mechanism. Finally, I will discuss an approach for unsupervised learning of a generic, distributed sentence encoder. I will show that on several tasks, including modelling images and text, these models significantly improve over many of the existing techniques.\n\n\n—\n\n\nRuslan Salakhutdinov received his PhD in computer science from the University of Toronto in 2009. After spending two post-doctoral years at the Massachusetts Institute of Technology Artificial Intelligence Lab, he joined the University of Toronto as an Assistant Professor in the Departments of Statistics and Computer Science. In 2016 he moved to the Machine Learning Department at Carnegie Mellon University. His primary interests lie in artificial intelligence, machine learning, deep learning, and large-scale optimization. He is an Alfred P. Sloan Research Fellow, Microsoft Research Faculty Fellow, Canada Research Chair in Statistical Machine Learning, a recipient of the Early Researcher Award, Connaught New Researcher Award, Google Faculty Award, and is a Senior Fellow of the Canadian Institute for Advanced Research.\n    \n  \n        \nPoster    \n  \n        \nEvent Website    \n  \n    Keywords:     \nLTI    \n  \n    For More Information, Please Contact:     \n\n\n\nfmetze [atsymbol] cs.cmu.edu", "Time": "2016-04-08 14:30:00-04:00", "URL": "https://www.scs.cmu.edu/calendar/fri-2016-04-08-1430/language-technologies-institute-colloquium", "University": "Carnegie Mellon University", "Tags": "", "Venue": "Gates&Hillman Centers"}, {"Topic": "Approximation algorithms for aversion k-clustering and local k-median    ", "Speaker": "GURU GURUGANESH    ", "Description": "Speaking Skills    \n  \n        \nGURU GURUGANESH    \n  \n        \nPH.D. Student    \n  \n        \nComputer Science Department    \n  \n        \nCarnegie Mellon University    \n  \n        \nApproximation algorithms for aversion k-clustering and local k-median    \n  \n        \nWednesday, April 20, 2016 - \n12:00pm to 1:00pm    \n  \n        \nASA Conference Room 6115     \n  \n        \nGates&Hillman Centers    \n  \n        \n\n\n[View Map]\n    \n  \n    Abstract:     \n\n\nIn the aversion k-clustering problem, given a metric space, we want to cluster the points into k clusters. The cost incurred by each point is the distance to the furthest point in its cluster, and the cost of the clustering is the sum of all these per-point-costs. This problem is motivated by questions in generating automatic abstractions of extensive-form games.\n\n\nWe reduce this problem to a local k-median problem where each facility has a prescribed radius and can only connect to clients within that radius. Our main results are a constant-factor bicriteria approximation algorithm for the local k-median problem, and hence a constant-factor approximation algorithm for the aversion k-clustering problem. We use a primal-dual approach; our technical contribution is a non-local rounding step which we feel is of broader interest.\n\n\nPresented in Partial Fulfillment of the CSD Speaking Skills Requirement. \n    \n  \n        \nPoster    \n  \n    Keywords:     \nCSD    \n  \n    For More Information, Please Contact:     \n\n\n\ndeb [atsymbol] cs.cmu.edu", "Time": "2016-04-20 12:00:00-04:00", "URL": "https://www.scs.cmu.edu/calendar/wed-2016-04-20-1200/computer-science-speaking-skills-talk", "University": "Carnegie Mellon University", "Tags": "", "Venue": "Gates&Hillman Centers"}, {"Topic": "CFA: A Practical Prediction System for Video QoE Optimization    ", "Speaker": "JUNCHEN JIANG    ", "Description": "Speaking Skills    \n  \n        \nJUNCHEN JIANG    \n  \n        \nPh.D. Student    \n  \n        \nComputer Science Department    \n  \n        \nCarnegie Mellon University    \n  \n        \nCFA: A Practical Prediction System for Video QoE Optimization    \n  \n        \nMonday, April 18, 2016 - \n12:00pm to 1:00pm    \n  \n        \nTraffic21 Classroom 6501     \n  \n        \nGates&Hillman Centers    \n  \n        \n\n\n[View Map]\n    \n  \n    Abstract:     \n\n\nMany prior efforts have suggested that Internet video Quality of Experience (QoE) could be dramatically improved by using data-driven prediction of video quality for different choices (e.g., CDN or bitrate) to make optimal decisions. However, building such a prediction system is challenging on two fronts. First, the relationships between video quality and observed session features can be quite complex. Second, video quality changes dynamically.\n\n\nThus, we need a prediction model that is (a) expressive enough to capture these complex relationships and (b) capable of updating quality predictions in near real-time. Unfortunately, several seemingly natural solutions (e.g., simple machine learning approaches and simple network models) fail on one or more fronts. Thus, the potential benefits promised by these prior efforts remain unrealized.\n\n\nWe address these challenges and present the design and implementation of Critical Feature Analytics (CFA). The design of CFA is driven by domain-specific insights that video quality is typically determined by a small subset of critical features whose criticality persists over several tens of minutes. This enables a scalable and accurate workflow where we automatically learn critical features for different sessions on coarse-grained timescales, while updating quality predictions in near real-time. Using a combination of a real-world pilot deployment and trace-driven analysis, we demonstrate that CFA leads to significant improvements in video quality; e.g., 32% less buffering time and 12% higher bitrate than a random decision maker.\n\n\nThis is a joint work with Vyas Sekar, Hui Zhang, and Ion Stoica \n\n\nPresented in Partial Fulfillment of the CSD Speaking Skills Requirement. \n    \n  \n        \nPoster    \n  \n    Keywords:     \nCSD    \n  \n    For More Information, Please Contact:     \n\n\n\ndeb [atsymbol] cs.cmu.edu", "Time": "2016-04-18 12:00:00-04:00", "URL": "https://www.scs.cmu.edu/calendar/mon-2016-04-18-1200/computer-science-speaking-skills-talk", "University": "Carnegie Mellon University", "Tags": "", "Venue": "Gates&Hillman Centers"}, {"Topic": "Peloton: Street Strength Database Management System for Real-Time Analytics     ", "Speaker": "JOY ARULRAJ    ", "Description": "Speaking Skills    \n  \n        \nJOY ARULRAJ    \n  \n        \nPh.D. Student    \n  \n        \nComputer Science Department    \n  \n        \nCarnegie Mellon University    \n  \n        \nPeloton: Street Strength Database Management System for Real-Time Analytics     \n  \n        \nThursday, April 14, 2016 - \n2:00pm to 3:00pm    \n  \n        \n8102     \n  \n        \nGates&Hillman Centers    \n  \n        \n\n\n[View Map]\n    \n  \n    Abstract:     \n\n\nData-intensive applications seek to obtain new insights in real-time by analyzing a combination of historical data sets alongside recently collected data. This means that to support such hybrid workloads, database management systems (DBMSs) need to handle both fast ACID transactions and complex analytical queries on the same database. But the current trend is to use specialized systems that are optimized for only one of these workloads, and thus require an organization to maintain separate copies of the database. This adds additional cost to deploying a database application in terms of both storage and administration overhead. \n\n\nTo overcome this barrier, we present a hybrid DBMS architecture that efficiently supports varied workloads on the same database. Our approach differs from previous methods in that we use a single execution engine that is oblivious to the storage layout of data without sacrificing the performance benefits of the specialized systems. This obviates the need to maintain separate copies of the database in multiple independent systems. We also present a technique to continuously evolve the databases physical storage layout by analyzing the queries access patterns and choosing the optimal layout for different segments of data within the same table. To evaluate this work, we implemented our architecture in an in-memory DBMS. Our results show that our approach delivers up to 3 times higher throughput compared to static storage layouts across different workloads. We also demonstrate that our continuous adaptation mechanism allows the DBMS to achieve a near-optimal layout for an arbitrary workload without requiring any manual tuning.\n\n\nThis is joint work with Andy Pavlo and Prashanth Menon. \n\n\nPresented in Partial Fulfillment of the CSD Speaking Skills Requirement. \n\n    \n  \n        \nPoster    \n  \n    Keywords:     \nCSD    \n  \n    For More Information, Please Contact:     \n\n\n\ndeb [atsymbol] cs.cmu.edu", "Time": "2016-04-14 14:00:00-04:00", "URL": "https://www.scs.cmu.edu/calendar/thu-2016-04-14-1400/computer-science-speaking-skills-talk", "University": "Carnegie Mellon University", "Tags": "", "Venue": "Gates&Hillman Centers"}, {"Topic": "Securing Passive Replication Through Verification    ", "Speaker": "BRUNO VAVALA    ", "Description": "Speaking Skills    \n  \n        \nBRUNO VAVALA    \n  \n        \nPh.D. Student    \n  \n        \nComputer Science Department    \n  \n        \nCarnegie Mellon University    \n  \n        \nSecuring Passive Replication Through Verification    \n  \n        \nFriday, April 29, 2016 - \n12:00pm to 1:00pm    \n  \n        \nTraffic21 Classroom 6501     \n  \n        \nGates&Hillman Centers    \n  \n        \n\n\n[View Map]\n    \n  \n    Abstract:     \n\n\nReplication is a fundamental technique to guarantee service availability and consistency. However, when a system component may misbehave, for instance due to a software intrusion, coordinating its replicas requires the adoption of complex distributed fault-tolerant protocols. In fact, such protocols require several executing replicas and many communication steps to work correctly. This results in redundant service executions that are inefficient and typically force the service to be deterministic so to achieve consistency (i.e., if correct replicas process the same requests in order, they produce the same output). \n\n\nIn this seminar we introduce the concept of hardware-based computation verification in the area of fault-tolerant replication. It is shown how the technique allows to deal with malicious replicas while linearly (in the number of replicas) reducing the computational effort to execute a fault-tolerant distributed service. In particular, we design a fully passive replicated system that dramatically reduces the fault-tolerance complexity, in terms of protocols, number of messages, processing effort and allows non-deterministic operations. Also, we implement a system prototype based on commodity hardware and on recent research work in Trusted Computing (TC). Finally, we show experimentally that our system delivers good performance, compared to optimized state-of-the-art systems, despite its main overhead is due to TC technology.\n\n\nPresented in Partial Fulfillment of the CSD Speaking Skills Requirement.\n    \n  \n        \nPoster    \n  \n    Keywords:     \nCSD    \n  \n    For More Information, Please Contact:     \n\n\n\ndeb [atsymbol] cs.cmu.edu", "Time": "2016-04-29 12:00:00-04:00", "URL": "https://www.scs.cmu.edu/calendar/fri-2016-04-29-1200/computer-science-speaking-skills-talk", "University": "Carnegie Mellon University", "Tags": "", "Venue": "Gates&Hillman Centers"}, {"Topic": "A Spreadsheet Model for Using Web Services and Creating Data-Driven Applications     ", "Speaker": "KERRY CHANG    ", "Description": "Thesis Orals    \n  \n        \nKERRY CHANG    \n  \n        \nPh.D. Student    \n  \n        \nHuman-Computer Interaction Institute    \n  \n        \nCarnegie Mellon University    \n  \n        \nA Spreadsheet Model for Using Web Services and Creating Data-Driven Applications     \n  \n        \nTuesday, April 12, 2016 - 2:30pm    \n  \n        \nRashid Auditorium 4401     \n  \n        \nGates&Hillman Centers    \n  \n        \n\n\n[View Map]\n    \n  \n    Abstract:     \n\n\nWeb services have made many kinds of data and computational services available. However, to use web services often requires significant programming efforts and thus limits the people who can take advantage of them to only a small group of skilled programmers. In this dissertation, I will present a tool called Gneiss that extends the spreadsheet model to support four challenging aspects of using web services: programming two-way data communications with web services, creating interactive GUI applications that use web services, using hierarchical data, and using live streaming data.\n\n\nGneiss contributes innovations in spreadsheet languages, spreadsheet user interfaces and interaction techniques to allow programming tasks that currently require writing complex, lengthy code to instead be done using familiar spreadsheet mechanisms. Spreadsheets are arguably the most successful and popular data tools among people of all programming levels. This work advances the use of spreadsheets to new domains and could benefit a wide range of users from professional programmers to end-user programmers.\n\n\nThesis Committee:Brad Myers  (Chair)Niki Kittur John ZimmermanMargaret Burnett (Oregon State University)\n\n\nCopy of Thesis Document\n    \n  \n        \nPoster    \n  \n    Keywords:     \nHCII    \n  \n    For More Information, Please Contact:     \n\n\n\nqkravitz [atsymbol] cs.cmu.edu", "Time": "2016-04-12 14:30:00-04:00", "URL": "https://www.scs.cmu.edu/calendar/tue-2016-04-12-1430/human-computer-interaction-thesis-defense", "University": "Carnegie Mellon University", "Tags": "", "Venue": "Gates&Hillman Centers"}, {"Topic": "THOMAS LATOZA    ", "Speaker": "TBD", "Description": "Seminars    \n  \n        \nTHOMAS LATOZA    \n  \n        \nAssistant Professor    \n  \n        \nDepartment of Computer Science    \n  \n        \nGeorge Mason University    \n  \n        \nTuesday, April 19, 2016 - \n12:00pm to 1:00pm    \n  \n        \nTraffic 21 Classroom 6501     \n  \n        \nGates&Hillman Centers    \n  \n        \n\n\n[View Map]\n    \n  \n        \nSeries Website    \n  \n    Keywords:     \nHCII    \n  \n    For More Information, Please Contact:     \n\n\n\njpuglisi [atsymbol] cs.cmu.edu", "Time": "2016-04-19 12:00:00-04:00", "URL": "https://www.scs.cmu.edu/calendar/tue-2016-04-19-1200/crowdsourcing-lunch-seminar", "University": "Carnegie Mellon University", "Tags": "", "Venue": "Gates&Hillman Centers"}, {"Topic": "Computer Science Division    ", "Speaker": "SAURABH GUPTA    ", "Description": "Seminars    \n  \n        \nSAURABH GUPTA    \n  \n        \nPh.D. Student    \n  \n        \nComputer Science Division    \n  \n        \nUniversity of California, Berkeley    \n  \n        \nScene Understanding from RGB-D Images    \n  \n        \nMonday, April 11, 2016 - \n3:00pm to 4:00pm    \n  \n        \n1507     \n  \n        \nNewell-Simon Hall    \n  \n        \n\n\n[View Map]\n    \n  \n    Abstract:     \n\n\nThe focus of this talk will be on detailed scene understanding from RGB-D images. We approach this problem by studying a variety of central vision problems like bottom-up grouping, object detection, instance segmentation, and pose estimation in context of RGB-D images, and finally aligning CAD models to objects in the scene. This results in a detailed output which goes beyond what most current computer vision algorithms produce: a bounding box or a segmentation mask for the object of interest; and is useful for a variety of real world applications like perceptual robotics, and augmented reality.  A central question in this work is how to learn good features for depth images in view of the fact that labeled RGB-D datasets are much smaller than labeled RGB datasets (such as ImageNet) typically used for feature learning, and I will describe our 'cross-modal distillation' technique which allows us to leverage easily available annotations on RGB images to learn representations on depth images. In addition, I will very briefly also talk about some work on vision and language that I did on an internship at Microsoft Research.\n\n\n—\n\n\nSaurabh Gupta is a Ph.D. student at UC Berkeley, where he is advised by Jitendra Malik. His research interests include computer vision and machine learning. During his PhD he has studied the problem of scene understanding from RGB-D images. His work has been supported by the Berkeley Fellowship and the Google Fellowship in Computer Vision.\n\n\nSponsored in part by Disney Research\n    \n  \n        \nPoster    \n  \n        \nEvent Website    \n  \n    Keywords:     \nVASC    \n  \n    For More Information, Please Contact:     \n\n\n\ncdowney [atsymbol] andrew.cmu.edu", "Time": "2016-04-11 15:00:00-04:00", "URL": "https://www.scs.cmu.edu/calendar/mon-2016-04-11-1500/vision-and-autonomous-systems-center-seminar", "University": "Carnegie Mellon University", "Tags": "", "Venue": "Newell-Simon Hall"}, {"Topic": "Algorithmic Transparency via Quantitative Input Influence: Theory and Experiments with Learning Systems    ", "Speaker": "SHAYAK SEN    ", "Description": "Speaking Skills    \n  \n        \nSHAYAK SEN    \n  \n        \nPh.D. Student    \n  \n        \nComputer Science Department    \n  \n        \nCarnegie Mellon University    \n  \n        \nAlgorithmic Transparency via Quantitative Input Influence: Theory and Experiments with Learning Systems    \n  \n        \nTuesday, April 12, 2016 - \n2:00pm to 3:00pm    \n  \n        \n7101     \n  \n        \nGates&Hillman Centers    \n  \n        \n\n\n[View Map]\n    \n  \n    Abstract:     \n\n\nAlgorithmic systems that employ machine learning play an ever-increasing role in making substantive decisions in modern society, ranging from online personalization to insurance and credit decisions to predictive policing. But their decision-making processes are often opaque---it is difficult to explain why a certain decision was made---thus raising concerns about inadvertent introduction of harms. We develop a formal foundation to improve the transparency of such decision-making systems that operate over large volumes of personal information about individuals.  Specifically, we introduce a family of Quantitative Input Influence (QII) measures that capture the degree of influence of inputs on outputs of machine learning algorithms. Our causal QII measures carefully account for correlations among inputs and capture input influence on aggregate effects on groups of individuals (e.g., disparate impact based on race).\n\n\nThe QII measures also capture the joint influence of a set of inputs on outputs using an aggregation method with a strong theoretical justification.  Apart from demonstrating general trends in a system, QII guides the construction of personalized transparency reports that provide insights into an individual's classification outcomes. Our empirical validation demonstrates that our QII measures are a useful transparency mechanism when black box access to the learning system is available; in particular, they provide better explanations than standard associative measures for a host of scenarios that we consider. Further, we show that in the situations we consider, QII is efficiently approximable and can be made differentially private with very little addition of noise. \n\n\nJoint work with Anupam Datta and Yair Zick. \n\n\nPresented in Partial Fulfillment of the CSD Speaking Skills Requirement. \n    \n  \n        \nPoster    \n  \n    Keywords:     \nCSD    \n  \n    For More Information, Please Contact:     \n\n\n\ndeb [atsymbol] cs.cmu.edu", "Time": "2016-04-12 14:00:00-04:00", "URL": "https://www.scs.cmu.edu/calendar/tue-2016-04-12-1400/computer-science-speaking-skills-talk", "University": "Carnegie Mellon University", "Tags": "", "Venue": "Gates&Hillman Centers"}, {"Topic": "HAK Language Technologies    ", "Speaker": "HASSAN AÏT-KACI    ", "Description": "Talks    \n  \n        \nHASSAN AÏT-KACI    \n  \n        \nHAK Language Technologies    \n  \n        \nTowards Declarative Scripting: Combining Constraint Processing and Analytics    \n  \n        \nFriday, April 8, 2016 - 10:00am    \n  \n        \nReddy Conference Room 4405     \n  \n        \nGates&Hillman Centers    \n  \n        \n\n\n[View Map]\n    \n  \n    Abstract:     \n\n\nThis is a high-level glance at current trends in the Analytics and Constraint Processing landscape from the perspective of declarative programming language use and design (the forest rather than the trees) as well as speculate and extrapolate some perspectives therefrom (what seems to be needed).  This presentation makes a statement concerning the current evolution of application software programming. In particular, it is noted that a new specific area of software development is rapidly gaining in importance; namely, scripting---i.e., application modules orchestration and choreography. This has become a clear need in particular for Data Analytics applications, which are typically multiplexed modules interacting between data and specific processing tools acting thereon, such as statistical analysis and simulation, optimization, graphing and HTML/LaTeX report generation, etc., ...\n\n\nWe take a look at some available scripting systems used in combination with constraint processing technology for application orchestration, making a note of their specific features, and discussing their pros and cons.  We also underline software engineering and maintenance issues faced when scripting constrained optimization. The question we seek to answer is, given the state of the art in declarative programming language design, is it possible to improve current scripting technology to be as concise and declarative as possible?\n\n\n—\n\n\nHassan Aït-Kaci holds a Ph.D. in Computer Science from the University of Pennsylvania (1984), and a Research Director Habilitation from University of Paris 7 (1990) also in CS. He was a member of research staff at MCC in Austin, TX, and at the Digital Paris Research Lab, where he contributed with the LIFE programming language. In 1994, he was appointed full professor at SFU, in Burnaby, BC, Canada, where he held a senior NSERC Industrial Research Chair. In 2000, he joined ILOG, a French multinational company specializing in developing high-performance AI, OR, and Graphics software tools. After ILOG’s acquisition by IBM in February 2009, he was a Senior Member of Technical Staff at IBM Canada. From January 2013 to January 2015, he was the holder of an ANR Chair of Excellence at the Université Claude Bernard Lyon 1 (UCBL), heading the CEDAR project (Constraint Event-Driven Automated Reasoning). In 2015, he was in charge of the LivEMUSIC project (Living Environment Monitoring Use Scenarios with Intelligent Control) also at the UCBL.\n\n\nThroughout his career, Dr. Aït-Kaci has contributed to the formal design and efficient implementation of very high-level and multi-paradigm programming environments. He pioneered the use of constraints for representing and processing knowledge (LogIn, LeFun, LIFE). His interests are in automated reasoning, knowledge representation, language processing, and machine learning.\n\n\nFaculty Host: Seth Goldstein\n    \n  \n        \nPoster    \n  \n    Keywords:     \nSCSFC    \n  \n    For More Information, Please Contact:     \n\n\n\nkhibner [atsymbol] cs.cmu.edu", "Time": "2016-04-08 10:00:00-04:00", "URL": "https://www.scs.cmu.edu/calendar/fri-2016-04-08-1000/scs-faculty-candidate-talk", "University": "Carnegie Mellon University", "Tags": "", "Venue": "Gates&Hillman Centers"}, {"Topic": "Global Phone Wars: Apple v. Samsung    ", "Speaker": "School of Computer Science    ", "Description": "Lecture    \n  \n        \nMICHAEL I. SHAMOS, Ph.D. J.D.    \n  \n        \nDistinguished Career Professor    \n  \n        \nSchool of Computer Science    \n  \n        \nCarnegie Mellon University    \n  \n        \nGlobal Phone Wars: Apple v. Samsung    \n  \n        \nTuesday, April 19, 2016 - 4:30pm    \n  \n        \nRashid Auditorium 4401     \n  \n        \nGates&Hillman Centers    \n  \n        \n\n\n[View Map]\n    \n  \n    Abstract:     \n\n\nThe global market for smartphones is huge – more than 1.4 billion are sold every year, just about the population of China. When Apple introduced the iPhone in 2007, Samsung completely modified its phones to resemble Apple’s, and has been gaining market share ever since. Apple owns patents covering some of the most fundamental user gestures, such as pinching to reduce the size of an image and swipe to unlock. The two have filed 20 lawsuit in nine countries over four continents, involving billions of dollars in claims and verdicts. On March 21, the U.S. Supreme Court agreed to hear Samsung’s appeal from just one of those verdicts. This talk will present the main technical issues behind the worldwide battle between two of the world’s largest companies.\n\n\n—\n\n\nMichael Shamos is an intellectual property attorney and computer scientist in the School of Computer Science at Carnegie Mellon University, where he directs a graduate program in eBusiness Technology and teaches Law of Computer Technology.  He has been an expert witness in over 200 cases involving computer technology.\n    \n  \n    Keywords:     \nSCS", "Time": "2016-04-19 16:30:00-04:00", "URL": "https://www.scs.cmu.edu/calendar/tue-2016-04-19-1630/scs-special-lecture", "University": "Carnegie Mellon University", "Tags": "", "Venue": "Gates&Hillman Centers"}, {"Topic": "Securing Passive Replication Through Verification    ", "Speaker": "BRUNO VAVALA    ", "Description": "Speaking Skills    \n  \n        \nBRUNO VAVALA    \n  \n        \nPh.D. Student    \n  \n        \nComputer Science Department    \n  \n        \nCarnegie Mellon University    \n  \n        \nSecuring Passive Replication Through Verification    \n  \n        \nMonday, April 11, 2016 - \n12:00pm to 1:00pm    \n  \n        \nTraffic 21 Classroom 6501     \n  \n        \nGates&Hillman Centers    \n  \n        \n\n\n[View Map]\n    \n  \n    Abstract:     \n\n\nReplication is a fundamental technique to guarantee service availability and consistency. However, when a  system component may misbehave, for instance due to a software intrusion, coordinating its replicas requires the adoption of complex distributed fault-tolerant protocols. In fact, such protocols require several executing replicas and many communication steps to work correctly. This results in redundant service executions that are inefficient and typically force the service to be deterministic so to achieveconsistency (i.e., if correct replicas process the same requests in order, they produce the same output).\n\n\nPresented in Partial Fulfillment of the CSD Speaking Skills Requirement.\n    \n  \n        \nPoster    \n  \n    Keywords:     \nCSD    \n  \n    For More Information, Please Contact:     \n\n\n\ndeb [atsymbol] cs.cmu.edu", "Time": "2016-04-11 12:00:00-04:00", "URL": "https://www.scs.cmu.edu/calendar/mon-2016-04-11-1200/computer-science-speaking-skills-talk", "University": "Carnegie Mellon University", "Tags": "", "Venue": "Gates&Hillman Centers"}, {"Topic": "Robots at Sea    ", "Speaker": "GUARAV S. SAKHATME    ", "Description": "Seminars    \n  \n        \nGUARAV S. SAKHATME    \n  \n        \nDean's Professor and Chairman    \n  \n        \nDepartment of Computer Science    \n  \n        \nUniversity of Southern California    \n  \n        \nRobots at Sea    \n  \n        \nFriday, April 8, 2016 - \n3:30pm to 4:30pm    \n  \n        \nMauldin Auditorium 1305     \n  \n        \nNewell-Simon Hall    \n  \n        \n\n\n[View Map]\n    \n  \n    Abstract:     \n\n\nUnderwater robotics is undergoing a transformation. Advances in AI and machine learning are enabling a new generation of underwater robots to make intelligent decisions (where to sample? how to navigate?) by reasoning about their environment (what is the shipping and water forecast?). At USC, we are engaged in a long-term effort to explore ideas and develop algorithms that will lead to persistent, autonomous underwater robots. In this talk, I will discuss some of our recent results focusing on two problems in adaptive sampling: underwater change detection and biological sampling. Time permitting; I will also present recent work on hazard avoidance, allowing underwater robots to operate in regions where there is substantial ship traffic.\n\n\n—\n\n\nGaurav S. Sukhatme is a Professor of Computer Science (joint appointment in Electrical Engineering) at the University of Southern California (USC). He received his undergraduate education at IIT Bombay in Computer Science and Engineering, and M.S. and Ph.D. degrees in Computer Science from USC. He is the co-director of the USC Robotics Research Laboratory and the director of the USC Robotic Embedded Systems Laboratory which he founded in 2000. His research interests are in multi-robot systems and sensor/actuator networks.\n\n\nHe has published extensively in these and related areas. Sukhatme has served as PI on numerous NSF, DARPA and NASA grants. He is a Co-PI on the Center for Embedded Networked Sensing (CENS), an NSF Science and Technology Center. He is a fellow of the IEEE and a recipient of the NSF CAREER award and the Okawa foundation research award. He is one of the founders of the Robotics: Science and Systems conference. He was program chair of the 2008 IEEE International Conference on Robotics and Automation and is program chair of the 2011 IEEE/RSJ International Conference on Robots and Systems. He is the Editor-in-Chief of Autonomous Robots and has served as Associate Editor of the IEEE Transactions on Robotics and Automation, the IEEE Transactions on Mobile Computing, and on the editorial board of IEEE Pervasive Computing.\n\n\nFaculty Host: Howie Choset\n    \n  \n        \nPoster    \n  \n        \nEvent Website    \n  \n    Keywords:     \nRI    \n  \n    For More Information, Please Contact:     \n\n\n\npm1e [atsymbol] andrew.cmu.edu", "Time": "2016-04-08 15:30:00-04:00", "URL": "https://www.scs.cmu.edu/calendar/fri-2016-04-08-1530/robotics-seminar", "University": "Carnegie Mellon University", "Tags": "", "Venue": "Newell-Simon Hall"}, {"Topic": "David: Principal Product Manager, RingCentral, Inc.    ", "Speaker": "DAVID HERSH, PETER PEZARIS, MICHAEL GERSH    ", "Description": "Lecture    \n  \n        \nDAVID HERSH, PETER PEZARIS, MICHAEL GERSH    \n  \n        \nDavid: Principal Product Manager, RingCentral, Inc.    \n  \n        \nPeter, Vice President of Operations, RingCentral, Inc.    \n  \n        \nMichael: Chief Operations Officer, Pixidio    \n  \n        \nWednesday, April 13, 2016 - \n12:30pm to 1:30pm    \n  \n        \nRoom 151     \n  \n        \nPosner Hall    \n  \n        \n\n\n[View Map]\n    \n  \n    Abstract:     \n\n\nJoin David, Peter and Michael, as they share their experiences and advice for fellow alumni entrepreneurs.\n\n\nAfter graduation, the three founded Commissioner.com, grew the company into one of the most popular fantasy sports sites on the Internet, and eventually sold it to CBS Sportsline. Ready for another challenge, they founded Multiply.com, a popular social network that they sold to Naspers in 2010. Their third project, Glip, Inc., a modern team conversation platform, sold to RingCentral in 2015. It’s a fascinating story of friendship, entrepreneurship andinnovation.\n\n\n—\n\n\nThe James R. Swartz Entrepreneurial Leadership Series provides a forum for the Carnegie Mellon University community and its entrepreneurial network partners to explore issues central to entrepreneurial leadership. Speakers include successful entrepreneurs, investors and innovators who are focused on emerging and growing market sectors that are important for competitiveness in the global economy.\n    \n  \n        \nPoster    \n  \n        \nSeries Website    \n  \n    Keywords:     \nCIE", "Time": "2016-04-13 12:30:00-04:00", "URL": "https://www.scs.cmu.edu/calendar/wed-2016-04-13-1230/james-r-swartz-enterpreneurial-leadership-lecture-series", "University": "Carnegie Mellon University", "Tags": "", "Venue": "Posner Hall"}, {"Topic": "Please   join in for another stimulating program showcasing exciting talent and ideas, university research, innovations, companies and connections. ", "Speaker": "TBD", "Description": "Talks    \n  \n        \nThursday, April 14, 2016 - \n4:30pm to 6:00pm    \n  \n        \nMcConomy Auditorium     \n  \n        \nCohon University Center    \n  \n        \n\n\n[View Map]\n    \n  \n    Abstract:     \n\n\nPlease   join in for another stimulating program showcasing exciting talent and ideas, university research, innovations, companies and connections. \n\n\n\nA reception will follow in the Connan Room.\n\n\nPlease register.\n\n\nThis and other Olympus Show & Tells are made possible by the generous support of K&L Gates.\n    \n  \n        \nPoster    \n  \n        \nEvent Website    \n  \n    Keywords:     \nCIE", "Time": "2016-04-14 16:30:00-04:00", "URL": "https://www.scs.cmu.edu/calendar/thu-2016-04-14-1630/olympus-project-show-tell-20", "University": "Carnegie Mellon University", "Tags": "", "Venue": "Cohon University Center"}, {"Topic": "What is it?", "Speaker": "TBD", "Description": "Project Presentations    \n  \n        \nWednesday, May 4, 2016 - \n10:00am to 5:00pm    \n  \n        \nCohon University Center    \n  \n        \n\n\n[View Map]\n    \n  \n    Abstract:     \n\n\nMeeting of the Minds is a university-wide celebration of undergraduate research. All Carnegie Mellon undergrads engaged in research and creative projects are encouraged to apply!\n\n\nWhat is it?\n\n\nThe Meeting of the Minds is a great opportunity to share your research with the entire campus community. All research projects are welcome - you don't have to be working on a SURG project to present. You can give an oral presentation on your project, design a poster, display your art, or give a live performance. Those with a more competitive streak can also register for one of the Special Competitions and compete for cash prizes!\n\n\nPlease Register here by 30 March 2016\n    \n  \n        \nEvent Website    \n  \n    Keywords:     \nMOM    \n  \n    For More Information, Please Contact:     \n\nCatherine Copetas, copetas [atsymbol] cs.cmu.edu", "Time": "2016-05-04 10:00:00-04:00", "URL": "https://www.scs.cmu.edu/calendar/wed-2016-05-04-1000/meeting-minds-undergraduate-student-research-symposium", "University": "Carnegie Mellon University", "Tags": "", "Venue": "Cohon University Center"}, {"Topic": "MARC: Co-founder and President, Boston Dynamics, Inc.    ", "Speaker": "IVAN SUTHERLAND and MARC RAIBERT    ", "Description": "SCS Distinguished Lectures    \n  \n        \nIVAN SUTHERLAND and MARC RAIBERT    \n  \n        \nIVAN: Visiting Scientist, Portland State University; Computer Graphics Pioneer    \n  \n        \nMARC: Co-founder and President, Boston Dynamics, Inc.    \n  \n        \nMachines That Walk    \n  \n        \nThursday, April 14, 2016 - 12:00pm    \n  \n        \nRashid Auditorium 4401     \n  \n        \nGates&Hillman Centers    \n  \n        \n\n\n[View Map]\n    \n  \n    Abstract:     \n\n\nMarc Raibert and Ivan Sutherland came to CMU in 1980 to build walking machines. Marc built a machine that balanced on one leg. Having less courage, Ivan built a machine that used six legs to avoid the balance problem. Marc demonstrated that balance is relatively easy and went on to build many more walking machines. Ivan's shorter attention span led him to abandon legged machines in favor of work on digital computing systems. \n\n\nMarc and Ivan will recount in words and pictures the fun they enjoyed with robots at CMU and elsewhere. They will end with a discussion about drawing inspiration from natural systems. The vast difference between the components found in natural systems and the components available for robots or computers limit our ability to draw inspiration from nature. Man-made systems must differ from natural systems. Those very differences provide central advantages and weaknesses.\n\n\nWith introduction by: Raj Reddy\n\n    \n  \n        \nPoster    \n  \n    Keywords:     \nRI/SCS DLS", "Time": "2016-04-14 12:00:00-04:00", "URL": "https://www.scs.cmu.edu/calendar/thu-2016-04-14-1200/teruko-yata-memorial-lecture-robotics", "University": "Carnegie Mellon University", "Tags": "", "Venue": "Gates&Hillman Centers"}, {"Topic": "Real-Time 3D Graphics from the Ground Up    ", "Speaker": "TBD", "Description": "Talks    \n  \n        \nReal-Time 3D Graphics from the Ground Up    \n  \n        \nWednesday, April 27, 2016 - \n8:00pm to 9:00pm    \n  \n        \n5421     \n  \n        \nWean Hall    \n  \n        \n\n\n[View Map]\n    \n  \n    Abstract:     \n\n\nRay-tracers can draw beautiful, detailed computer-generated scenes, but they can take hours (or days!) to draw one frame. So how do video games draw 3D scenes when they have less than 30 milliseconds to output a frame? This talk draws back the curtain on systems like OpenGL and DirectX, to show you how they work under the hood.\n\n\n—\n\n\nHave you ever wondered how fast inverse square root works, wanted to learn a bit of computing history, or craved the thrill of learning a new language again, but didn't know where to start looking? Look no further! Whether you're a hacking veteran or a newfound computer lover, there's something for you in Computer Club's Spring 2016 weekly talk series, so swing on by!\n\n\nSponsored by Green Hills Software.\n    \n  \n        \nSeries Poster    \n  \n        \nSeries Website    \n  \n    Keywords:     \nCMUCC", "Time": "2016-04-27 20:00:00-04:00", "URL": "https://www.scs.cmu.edu/calendar/wed-2016-04-27-2000/carnegie-mellon-computer-club-spring-talk-series", "University": "Carnegie Mellon University", "Tags": "", "Venue": "Wean Hall"}, {"Topic": "CoffeeScript => WebGL Solar Systems!    ", "Speaker": "TBD", "Description": "Talks    \n  \n        \nCoffeeScript => WebGL Solar Systems!    \n  \n        \nWednesday, April 20, 2016 - \n8:00pm to 9:00pm    \n  \n        \n5421     \n  \n        \nWean Hall    \n  \n        \n\n\n[View Map]\n    \n  \n    Abstract:     \n\n\nCoffeeScript is a nifty little language which can be used to write simultaneously more clear and more complicated code. In this workshop, we will examine some of the more interesting consequences of using CoffeeScript with existing JavaScript frameworks.\n\n\n—\n\n\nHave you ever wondered how fast inverse square root works, wanted to learn a bit of computing history, or craved the thrill of learning a new language again, but didn't know where to start looking? Look no further! Whether you're a hacking veteran or a newfound computer lover, there's something for you in Computer Club's Spring 2016 weekly talk series, so swing on by!\n\n\nThe talksl take place every Wednesday starting at 8:00 PM in Wean 5421 throughout the semester.\n\n\nSponsored by Green Hills Software.\n    \n  \n        \nSeries Poster    \n  \n        \nSeminar Website    \n  \n    Keywords:     \nCMUCC", "Time": "2016-04-20 20:00:00-04:00", "URL": "https://www.scs.cmu.edu/calendar/wed-2016-04-20-2000/carnegie-mellon-computer-club-spring-talk-series", "University": "Carnegie Mellon University", "Tags": "", "Venue": "Wean Hall"}, {"Topic": "Apple 1985-1997: The Jobless Years    ", "Speaker": "TBD", "Description": "Talks    \n  \n        \nApple 1985-1997: The Jobless Years    \n  \n        \nWednesday, April 13, 2016 - \n8:00pm to 9:00pm    \n  \n        \n5421     \n  \n        \nWean Hall    \n  \n        \n\n\n[View Map]\n    \n  \n    Abstract:     \n\n\nApple is a company whose history is well-documented. However, emphasis tends to be put on the company's time under the leadership of Steve Jobs. In this talk we'll be discussing Apple under the tenure of CEOs John Sculley, Michael Spindler, and Gil Amelio, and the causes of its decline in the 1990s.\n\n\n—\n\n\nHave you ever wondered how fast inverse square root works, wanted to learn a bit of computing history, or craved the thrill of learning a new language again, but didn't know where to start looking? Look no further! Whether you're a hacking veteran or a newfound computer lover, there's something for you in Computer Club's Spring 2016 weekly talk series, so swing on by!\n\n\nThe talksl take place every Wednesday starting at 8:00 PM in Wean 5421 throughout the semester.\n\n\nSponsored by Green Hills Software.\n    \n  \n        \nSeries Poster    \n  \n        \nSeries Website    \n  \n    Keywords:     \nCMUCC", "Time": "2016-04-13 20:00:00-04:00", "URL": "https://www.scs.cmu.edu/calendar/wed-2016-04-13-2000/carnegie-mellon-computer-club-spring-talk-series", "University": "Carnegie Mellon University", "Tags": "", "Venue": "Wean Hall"}]}