{"records": [{"Topic": "Estimating High-Dimensional Autoregressive Point Processes    ", "Speaker": "REBECCA WILLETT    ", "Description": "Seminars    \n  \n        \nREBECCA WILLETT    \n  \n        \nAssociate Professor, Department of Electrical & Computer Engineering    \n  \n        \nFellow of the Wisconsin Institute of Discovery    \n  \n        \nUniversity of Wisconsin - Madison    \n  \n        \nEstimating High-Dimensional Autoregressive Point Processes    \n  \n        \nTuesday, March 29, 2016 - 2:00pm    \n  \n        \n3305     \n  \n        \nNewell-Simon Hall    \n  \n        \n\n\n[View Map]\n    \n  \n    Abstract:     \n\n\nVector autoregressive models characterize a variety of time series in which linear combinations of current and past observations can be used to accurately predict future observations.  For instance, each element of an observation vector could correspond to a different node in a network, and the parameters of an autoregressive model would correspond to the impact of the network structure on the time series of observations at each network node. Of particular interest are autoregressive point processes, in which observations consist of the times at which each node participates in some event or activity. Such data is common in spike train observations of biological neural networks, interactions within a social network, and pricing changes within financial networks.  However, very little is known about how many events must be recorded before we may accurately infer the underlying autoregressive models. \n\n\nI will describe sparsity-regularized methods and associated performance bounds which provide new insight into the sample complexity of these problems in high dimensions.  While sparsity-regularization is well-studied in the statistics and machine learning communities, common assumptions from that literature (such as the restricted eigenvalue condition) are difficult to verify in this setting because of the correlations and heteroscedasticity of the observations.  A novel analysis method leveraging a combination of Martingale concentration inequalities and high-dimensional linear regression characterizes how much data must be collected to ensure reliable inference depending on the size and sparsity of the autoregressive parameters, and these bounds are supported by several empirical studies.\n\n\n—\n\n\nRebecca Willett is an Associate Professor of Electrical and Computer Engineering and Fellow of the Wisconsin Institutes for Discovery with an affiliate appointment in Computer Sciences at the University of Wisconsin-Madison. She completed her PhD in Electrical and Computer Engineering at Rice University in 2005 and was an Assistant then tenured Associate Professor of Electrical and Computer Engineering at Duke University from 2005 to 2013. Willett received the National Science Foundation CAREER Award in 2007, is a member of the DARPA Computer Science Study Group, and received an Air Force Office of Scientific Research Young Investigator Program award in 2010. Willett has also held visiting researcher or faculty positions at the University of Nice in 2015, the Institute for Pure and Applied Mathematics at UCLA in 2004, the University of Wisconsin-Madison 2003-2005, the French National Institute for Research in Computer Science and Control (INRIA) in 2003, and the Applied Science Research and Development Laboratory at GE Healthcare in 2002. \n\n\nFaculty Hosts: Aarti Singh (ML) and Aswin Sankaranarayanan (ECE)\n    \n  \n        \nPoster    \n  \n        \nEvent Website    \n  \n    Keywords:     \nML/ECE    \n  \n    For More Information, Please Contact:     \n\n\n\nsandyw [atsymbol] cs.cmu.edu", "Time": "2016-03-29 14:00:00-04:00", "URL": "https://www.scs.cmu.edu/calendar/tue-2016-03-29-1400/joint-machine-learning-electrical-and-computer-engineering-special-seminar", "University": "Carnegie Mellon University", "Tags": "", "Venue": "Newell-Simon Hall"}, {"Topic": "Transition-based Natural Language Processing    ", "Speaker": "MIGUEL BALLESTEROS    ", "Description": "Talks    \n  \n        \nMIGUEL BALLESTEROS    \n  \n        \nPostdoctoral Researcher    \n  \n        \nDepartment of Information and Communication Technologies    \n  \n        \nPompeu Fabra University, Barcelona    \n  \n        \nTransition-based Natural Language Processing    \n  \n        \nThursday, March 10, 2016 - 1:00pm    \n  \n        \nASA Conference Room 6115     \n  \n        \nGates&Hillman Centers    \n  \n        \n\n\n[View Map]\n    \n  \n    Abstract:     \n\n\nThis talk describes new, sequential and efficient algorithms for analysis of text data. Transition-based models use a transition system, or abstract state machine, to model structured prediction problems, for example syntactic dependency parsing, as a sequence of actions. We propose a technique for learning representations of these states. Our primary innovation is a new control structure for sequence-to-sequence neural networks: the stack LSTM. Like the conventional stack data structures used in transition-based parsing, elements can be pushed to or popped from the top of the stack in constant time, but, in addition, an LSTM maintains a continuous space embedding of the stack contents. This lets us formulate efficient transition-based natural language processing models that captures three facets of the state: (i) unbounded look-ahead into the buffer of incoming words, (ii) the complete history of transition actions taken, and (iii) the complete contents of the stack of partially built fragments, including their internal structures.\n\n\nWe also discuss different approaches to word representations, by modeling words and by modeling characters. The latter improves the way of handling out of vocabulary words without using external resources and improves the performance in morphologically rich languages. Transition-based modeling for natural language processing is not limited to syntactic parsing. In this talk I will explain how we successfully applied Stack-LSTMs to dependency parsing, phrase-structure parsing, language modeling and named entity recognition with outstanding results.\n\n\n—\n\n\nMiguel Ballesteros is a Postdoctoral Researcher at Pompeu Fabra University, in Barcelona (Spain). He is also a visiting postdoc/lecturer in Carnegie Mellon University. Previously, he completed his PhD, Masters and undergraduate degree at the Complutense University of Madrid (Spain). Miguel works in the intersection of natural language processing and machine learning with a special interest in syntactic analysis, dependency parsing and phrase structure parsing. He is also exploring different natural language processing problems including semantic parsing, named entity recognition, coreference resolution and language modeling. Moreover, he has an interest in accessibility with a strong belief that computational linguistics can have a significant impact on improving society.\n\n\nFaculty Host: Alan Black\n    \n  \n        \nPoster    \n  \n    Keywords:     \nSCSFC    \n  \n    For More Information, Please Contact:     \n\n\n\nkhibner [atsymbol] cs.cmu.edu", "Time": "2016-03-10 13:00:00-05:00", "URL": "https://www.scs.cmu.edu/calendar/thu-2016-03-10-1300/scs-faculty-candidate-talk", "University": "Carnegie Mellon University", "Tags": "", "Venue": "Gates&Hillman Centers"}, {"Topic": "Data-driven Social Informatics    ", "Speaker": "GITA REESE SUKTHANKAR    ", "Description": "Seminars    \n  \n        \nGITA REESE SUKTHANKAR    \n  \n        \nAssociate Professor    \n  \n        \nDepartment of Computer Science and Charles N. Millican Faculty Fellow    \n  \n        \nUniversity of Central Florida    \n  \n        \nData-driven Social Informatics    \n  \n        \nFriday, March 25, 2016 - \n3:30pm to 4:30pm    \n  \n        \nMauldin Auditorium 1305     \n  \n        \nGates&Hillman Centers    \n  \n        \n\n\n[View Map]\n    \n  \n    Abstract:     \n\n\nData-driven social informatics unites models derived from social science with data-driven approaches in order to model and predict population behavior patterns. It can be used to advance our understanding of human behavior, guide public policy decisions, and improve user experience with both robots and software agents. In this talk, I'll describe work from my lab in which we use a combination of agent-based modeling, machine learning, and crowdsourcing to model human social systems. The benefits of this approach will be illustrated using three case studies: 1) predicting the influence of social norms on smoking cessation behavior, 2) tracking campus parking usage using crowdsourcing and transportation modeling, 3) learning collaboration patterns from co-authorship networks. We believe that the combination of techniques yields a more nuanced view that relying on data alone.\n\n\n—\n\n\nDr. Gita Sukthankar is an Associate Professor and Charles N. Millican Faculty Fellow in the Department of Computer Science at the University of Central Florida, and an affiliate faculty member at UCF’s Institute for Simulation and Training. She received her Ph.D. from the Robotics Institute at Carnegie Mellon and an A.B. in psychology from Princeton University. Dr. Sukthankar has received an Air Force Young Investigator award, a DARPA Computer Science Study grant, and the NSF CAREER. Gita Sukthankar’s research focuses on multi-agent systems and computational social models. She is the lead editor of the book: Plan, Activity, and Intent Recognition: Theory and Practice and currently serves on DARPA's Information Science and Technology advisory group.\n\n\nFaculty Host: Katia Sycara\n    \n  \n        \nEvent Website    \n  \n    Keywords:     \nRI    \n  \n    For More Information, Please Contact:     \n\n\n\nkmmills [atsymbol] andrew.cmu.edu", "Time": "2016-03-25 15:30:00-04:00", "URL": "https://www.scs.cmu.edu/calendar/fri-2016-03-25-1530/robotics-seminar", "University": "Carnegie Mellon University", "Tags": "", "Venue": "Gates&Hillman Centers"}, {"Topic": "Research Associate    ", "Speaker": "DESHENG ZHANG    ", "Description": "Talks    \n  \n        \nDESHENG ZHANG    \n  \n        \nResearch Associate    \n  \n        \nDepartment of Computer Science and Engineering    \n  \n        \nUniversity or Minnesota    \n  \n        \nCross-Domain Cyber-Physical Systems for Smart Cities: Addressing Mobility Challenges by Urban Systems with Urban Data    \n  \n        \nTuesday, March 8, 2016 - 1:00pm    \n  \n        \nASA Conference Room 6115     \n  \n        \nGates&Hillman Centers    \n  \n        \n\n\n[View Map]\n    \n  \n    Abstract:     \n\n\nFor the first time ever, we have more people living in urban areas than rural areas. Based on this inevitable urbanization, my research aims to address sustainability challenges related to urban mobility (e.g., energy consumption and traffic congestion) by data-driven applications with a Cyber-Physical-Systems approach (CPS, also known as a broader term for Internet of Things), which is a new information paradigm integrating communication, computation and control in real time. Under the context of a smart cities initiative proposed by the White House, in this talk, I will focus on CPS related to large-scale cross-domain urban systems, e.g., taxi, bus, subway, cellphone and smart payment systems.\n\n\nI will first show how cross-domain data from these systems can be collaboratively utilized to capture urban mobility in real time by a new technique called multi-view bounding, which addresses overfitting issues of existing mobility models driven by single-domain data. Then I will show how the captured real-time mobility can be used to design a practical service, i.e., mobility-driven ridesharing, to provide positive feedback to urban systems themselves, e.g., reducing energy consumption and traffic congestion. Finally, I will present real-world impact of my research and some future work about CPS for smart cities.\n\n\n—\n\n\nDesheng Zhang is a Research Associate at Department of Computer Science and Engineering of the University of Minnesota. Previously, he was offered the Senseable City Consortium Postdoctoral Fellowship from MIT and awarded his Ph.D in Computer Science from University of Minnesota. His research is uniquely built upon 10TB urban data from 10 kinds of cross-domain urban systems, including cellphone, smartcard, taxi, bus, truck, subway, bike, personal vehicle, electric vehicle, and road networks in 8 cities across 3 continents with 100 million urban residents involved. Desheng designs and implements large-scale data-driven models and real-world services to address urban sustainability challenges. Desheng has published more than 20 papers, featuring 11 first-author papers in premium Computer Science venues, e.g., MobiCom, SenSys, IPSN, ICCPS, SIGSPATIAL, ICDCS, RTSS, BIGDATA and 6 best paper/thesis/poster awards.\n\n\nFaculty Host:  Yuvraj Agarwal\n    \n  \n        \nPoster    \n  \n    Keywords:     \nSCSFC    \n  \n    For More Information, Please Contact:     \n\n\n\nkhibner [atsymbol] cs.cmu.edu", "Time": "2016-03-08 13:00:00-05:00", "URL": "https://www.scs.cmu.edu/calendar/tue-2016-03-08-1300/scs-faculty-candidate-talk", "University": "Carnegie Mellon University", "Tags": "", "Venue": "Gates&Hillman Centers"}, {"Topic": "Optimizing Optimization: Scalable Convex Programming with Proximal Operators    ", "Speaker": "MATT WYTOCK    ", "Description": "Thesis Orals    \n  \n        \nMATT WYTOCK    \n  \n        \nPh.D. Student    \n  \n        \nMachine Learning Department    \n  \n        \nCarnegie Mellon University    \n  \n        \nOptimizing Optimization: Scalable Convex Programming with Proximal Operators    \n  \n        \nTuesday, March 8, 2016 - 3:00pm    \n  \n        \n8102     \n  \n        \nGates&Hillman Centers    \n  \n        \n\n\n[View Map]\n    \n  \n    Abstract:     \n\n\nConvex optimization has developed a wide variety of useful tools critical to many applications in machine learning. However, unlike linear and quadratic program- ming, general convex solvers have not yet reached sufficient maturity to fully decouple the convex programming model from the numerical algorithms required for implementation. Especially as datasets grow in size, there is a significant gap in speed and scalability between general solvers and specialized algorithms\n\n\nThis thesis addresses this gap with a new model for convex programming based on an intermediate representation of convex problems as a sum of functions with ef- ficient proximal operators. This representation serves two purposes: 1) many problems can be expressed in terms of functions with simple proximal operators, and 2) the proximal operator form serves as a general interface to any specialized algorithm that can incorporate additional l2-regularization. On a single CPU core, numerical results demonstrate that the prox-affine form results in significantly faster algorithms than existing general solvers based on conic forms. In addition, splitting problems into separable sums is attractive from the perspective of distributing solver work amongst multiple cores and machines.\n\n\nWe apply large-scale convex programming to several problems arising from building the next-generation, information-enabled electrical grid. In these problems (as is common in many domains) large, high-dimensional datasets present opportunities for novel data-driven solutions. We present approaches based on convex models for several problems: probabilistic forecasting of electricity generation and demand, preventing failures in microgrids and source separation for whole-home energy disaggregation.\n\n\nThesis Committee:J. Zico Kolter (Chair)Ryan Tibshirani (Statistics/CMU)Geoffrey GordonStephen Boyd (Stanford University)Arunava Majumdar (Stanford University)\n\n\nCopy of Thesis Document\n    \n  \n        \nPoster    \n  \n    Keywords:     \nMLD    \n  \n    For More Information, Please Contact:     \n\n\n\ndiane [atsymbol] cs.cmu.edu", "Time": "2016-03-08 15:00:00-05:00", "URL": "https://www.scs.cmu.edu/calendar/tue-2016-03-08-1500/machine-learning-thesis-defense", "University": "Carnegie Mellon University", "Tags": "", "Venue": "Gates&Hillman Centers"}, {"Topic": "Data-Driven Text Analysis with Joint Models    ", "Speaker": "GREG DURRETT    ", "Description": "Talks    \n  \n        \nGREG DURRETT    \n  \n        \nPh.D. Candidate     \n  \n        \nElectrical Engineering and Computer Sciences    \n  \n        \nUniversity of California, Berkeley    \n  \n        \nData-Driven Text Analysis with Joint Models    \n  \n        \nMonday, March 7, 2016 - 10:00am    \n  \n        \nASA Conference Room 6115     \n  \n        \nGates&Hillman Centers    \n  \n        \n\n\n[View Map]\n    \n  \n    Abstract:     \n\n\nOne reason analyzing text is hard is that it involves dealing with deeply entangled linguistic variables: objects like syntactic structures, semantic types, and discourse relations depend on one another in complex ways.  Our work tackles these interactions directly using joint modeling.  This type of model structure allows us to combine component models for each analysis subtask and pass information between them, both reconciling and reinforcing the components' predictions.  Joint models can also capture the dual discrete and continuous nature of language, specifically by integrating neural networks, which process continuous signals, with discrete structured models.  We describe state-of-the-art systems for a range of established NLP tasks, including syntactic parsing, entity resolution, and document summarization.\n\n\n—\n\n\nGreg Durrett is a Ph.D. candidate at UC Berkeley working on natural language processing with Dan Klein.  He is interested in building structured machine learning models for a wide variety of language understanding problems and downstream NLP applications.  His work combines two broad thrusts: first, designing joint models that combine information across different tasks or different views of a problem, and second, building systems that strike a balance between being linguistically motivated and data driven.\n    \n  \n        \nPoster    \n  \n    Keywords:     \nSCSFC    \n  \n    For More Information, Please Contact:     \n\n\n\nkhibner [atsymbol] cs.cmu.edu", "Time": "2016-03-07 10:00:00-05:00", "URL": "https://www.scs.cmu.edu/calendar/mon-2016-03-07-1000/scs-faculty-candidate-talk", "University": "Carnegie Mellon University", "Tags": "", "Venue": "Gates&Hillman Centers"}, {"Topic": "Please   join in for another stimulating program showcasing exciting talent and ideas, university research, innovations, companies and connections. ", "Speaker": "TBD", "Description": "Talks    \n  \n        \nThursday, April 14, 2016 - \n4:30pm to 6:00pm    \n  \n        \nMcConomy Auditorium     \n  \n        \nCohon University Center    \n  \n        \n\n\n[View Map]\n    \n  \n    Abstract:     \n\n\nPlease   join in for another stimulating program showcasing exciting talent and ideas, university research, innovations, companies and connections. \n\n\n\nA reception will follow in the Connan Room.\n\n\nPlease register.\n\n\nThis and other Olympus Show & Tells are made possible by the generous support of K&L Gates.\n    \n  \n        \nPoster    \n  \n        \nEvent Website    \n  \n    Keywords:     \nCIE", "Time": "2016-04-14 16:30:00-04:00", "URL": "https://www.scs.cmu.edu/calendar/thu-2016-04-14-1630/olympus-project-show-tell-20", "University": "Carnegie Mellon University", "Tags": "", "Venue": "Cohon University Center"}, {"Topic": "Social Cybersecurity: Understanding and Leveraging Social Influence to Improve End-User Security Sensitivity    ", "Speaker": "SAUVIK DAS    ", "Description": "Thesis Proposals    \n  \n        \nSAUVIK DAS    \n  \n        \nPh.D. Student    \n  \n        \nHuman-Computer Interaction Institute    \n  \n        \nCarnegie Mellon University    \n  \n        \nSocial Cybersecurity: Understanding and Leveraging Social Influence to Improve End-User Security Sensitivity    \n  \n        \nMonday, March 7, 2016 - 2:30pm    \n  \n        \n3305     \n  \n        \nNewell-Simon Hall    \n  \n        \n\n\n[View Map]\n    \n  \n    Abstract:     \n\n\nDespite substantial improvements made by the usable privacy and security community at raising the general populace’s awareness of, motivation to use, and knowledge of how to use security and privacy tools (i.e., their security sensitivity), much security advice remains ignored and many security tools remain underutilized. In this thesis, I argue that this this low security sensitivity can partially be explained by the fact that traditional security and privacy behaviors can have myriad social consequences. For example, by using two-factor authentication, one might also be perceived as “paranoid” or as someone with something to hide. Yet, to date, little theoretical work in usable privacy and security has applied social science theory to understand how these potential social consequences affect people’s security sensitivity. Likewise, little systems work in usable privacy and security has considered the social consequences of security tool designhttp://www.cs.cmu.edu/, nor have many security tools been developed with social principles in mind.\n\n\nTo bridge this gap in the literature, I will begin to build a theory of social cybersecurity and apply these theoretical insights to create interventions and security tools that improve people’s security sensitivity. Specifically, through a series of observational studies, I will construct both qualitative and quantitative models of behavior to explore how and why social factors influence security sensitivity and, in turn, the diffusion of security tool adoptions through a social network. I will then conduct a series of random experiments to test if these these observational insights can be leveraged to enhance security sensitivity. I will then distill these observational and experimental results into a set of concrete design guidelines and recommendations for the effective use of social influence to increase security sensitiviy and to improve security and privacy tools. Finally, to begin exploring the design space of social cybersecurity systems, I will design, implement, and evaluate a socially compatible security system, Thumprint. In a field deployment, I will use Thumprint as a design probe to better understand how the introduction of a “social” cybersecurity system affects security practices and social dynamics.\n\n\nConcretely, this thesis will provide the following contributions: (i) an initial theory of social cybersecurity, developed from both observational and experimental work, that explains how social factors affect people’s security sensitivity—i.e., their awareness of, motivation to use, and knowledge of how to use security tools; (ii) a set of design recommendations for creating better, more socially compatible security and privacy systems; and, (iii) the design, implementation and evaluation of a system that leverages these design recommendations to explore the design space of social cybersecurity systems.\n\n\nThesis Committee: Jason Hong (Chair) Laura Dabbish (Co-chair)Jeffrey Bigham J.D. Tygar (University of California, Berkeley)\n\n\nCopy of Proposal Document\n    \n  \n        \nPoster    \n  \n    Keywords:     \nHCII    \n  \n    For More Information, Please Contact:     \n\n\n\nqkravitz [atsymbol] cs.cmu.edu", "Time": "2016-03-07 14:30:00-05:00", "URL": "https://www.scs.cmu.edu/calendar/mon-2016-03-07-1430/human-computer-interaction-thesis-proposal", "University": "Carnegie Mellon University", "Tags": "", "Venue": "Newell-Simon Hall"}, {"Topic": "What is it?", "Speaker": "TBD", "Description": "Project Presentations    \n  \n        \nWednesday, May 4, 2016 - \n10:00am to 5:00pm    \n  \n        \nCohon University Center    \n  \n        \n\n\n[View Map]\n    \n  \n    Abstract:     \n\n\nMeeting of the Minds is a university-wide celebration of undergraduate research. All Carnegie Mellon undergrads engaged in research and creative projects are encouraged to apply!\n\n\nWhat is it?\n\n\nThe Meeting of the Minds is a great opportunity to share your research with the entire campus community. All research projects are welcome - you don't have to be working on a SURG project to present. You can give an oral presentation on your project, design a poster, display your art, or give a live performance. Those with a more competitive streak can also register for one of the Special Competitions and compete for cash prizes!\n\n\nPlease Register here by 30 March 2016\n    \n  \n        \nEvent Website    \n  \n    Keywords:     \nMOM    \n  \n    For More Information, Please Contact:     \n\nCatherine Copetas, copetas [atsymbol] cs.cmu.edu", "Time": "2016-05-04 10:00:00-04:00", "URL": "https://www.scs.cmu.edu/calendar/wed-2016-05-04-1000/meeting-minds-undergraduate-student-research-symposium", "University": "Carnegie Mellon University", "Tags": "", "Venue": "Cohon University Center"}, {"Topic": "What can Neural Machine Translation Learn from Symbolic Methods?    ", "Speaker": "GRAHAM NEUBIG    ", "Description": "Seminars    \n  \n        \nGRAHAM NEUBIG    \n  \n        \nAssistant Professor    \n  \n        \nGraduate School of Information Science    \n  \n        \nNara Institute of Science and Technology (NAIST)     \n  \n        \nWhat can Neural Machine Translation Learn from Symbolic Methods?    \n  \n        \nFriday, March 4, 2016 - 10:00am    \n  \n        \nASA Conference Room 6115     \n  \n        \nGates&Hillman Centers    \n  \n        \n\n\n[View Map]\n    \n  \n    Abstract:     \n\n\nIn this talk, I will compare and contrast two major paradigms for statistical machine translation (MT), and explain our ongoing work on methods to unify the two. The first and more traditional paradigm, using symbolic methods, work by dividing sentences up into small chunks, translating these chunks, and re-combining the chunks into a full sentence translation. The second paradigm, using neural methods, generates the target words one-by-one according to a probabilistic model that considers the source sentence and the previous words in the target.\n\n\nFirst, I will overview the symbolic methods, specifically focusing on our work on syntax-based MT that has allowed us to achieve state-of-the-art results on language pairs with very different word orders. Given this background, I will describe neural MT, contrasting it to the more traditional symbolic methods, and showing results demonstrating the relatively new neural MT paradigm's enormous potential, but also pointing out some quirks that seriously impact its usability in real MT applications. Finally, I will present a new technique that we have recently developed to incorporate information from symbolic models into neural models, and describe ongoing work to use this and similar techniques to create neural MT systems that are as flexible and reliable as their symbolic counterparts.\n\n\n—\n\n\nGraham Neubig am currently an assistant professor at the Nara Institute of Science and Technology (NAIST) Graduate School of Information Science, affiliated with the Augmented Human Communication Laboratory.  I completed my PhD at Kyoto University in 2013 with Prof. Tatsuya Kawahara.  \n\n\nMy research focuses on handling human languages (like English or Japanese) with computers, so called natural language processing.  In particular, I am interested in machine learning approaches that are both linguistically motivated and tailored to applications such as machine translation and speech recognition.  I like developing and have created open-source software.  I also have had a chance to give tutorials and talks on subjects such as machine translation, neural networks, and language modeling. \n\n\nFaculty Host: Alan Black\n    \n  \n        \nPoster    \n  \n    Keywords:     \nSCSFC    \n  \n    For More Information, Please Contact:     \n\n\n\nmaryjob [atsymbol] cs.cmu.edu", "Time": "2016-03-04 10:00:00-05:00", "URL": "https://www.scs.cmu.edu/calendar/fri-2016-03-04-1000/scs-faculty-candidate-talk", "University": "Carnegie Mellon University", "Tags": "", "Venue": "Gates&Hillman Centers"}, {"Topic": "Director, Newman Laboratory for BIomechanics and Human Rehabilitation    ", "Speaker": "NEVILLE HOGAN    ", "Description": "Seminars    \n  \n        \nNEVILLE HOGAN    \n  \n        \nProfessor of Mechanical Engineering, Brain and Cognitive Sciences    \n  \n        \nDirector, Newman Laboratory for BIomechanics and Human Rehabilitation    \n  \n        \nMassachusetts Institute of Technology    \n  \n        \nThe Paradox of Human Performance    \n  \n        \nFriday, March 18, 2016 - \n3:30pm to 4:30pm    \n  \n        \nMauldin Auditorium 1305     \n  \n        \nNewell-Simon Hall    \n  \n        \n\n\n[View Map]\n    \n  \n    Abstract:     \n\n\nHuman dexterity and agility vastly exceed that of contemporary robots. Yet humans have vastly slower ‘hardware’ (e.g. muscles) and ‘wetware’ (e.g. neurons). How can this paradox be resolved? Slow actuators and long communication delays require predictive control based on some form of internal model—but what form? I will argue that a plausible answer is based on dynamic primitives; they enable highly dynamic behavior with minimal high-level supervision and intervention. Controlling physical interaction requires mechanical impedance to be among the classes of dynamic primitives. I will review how pre-computing appropriate mechanical impedance may be cast as an optimization problem, provided the objective function includes both force and motion at an interaction port. To combine both motion and interaction primitives, I propose a nonlinear generalization of the classical equivalent circuit. It reconciles contrasting constraints of information-processing (computation) and energy-processing (physical dynamics). I suggest that nonlinear equivalent networks provide a general basis for the internal models required for high-performance interactive control.\n\n\n—\n\n\nNeville Hogan is Professor of Mechanical Engineering, Professor of Brain and Cognitive Sciences and Director of the Newman Laboratory for Biomechanics and Human Rehabilitation at the Massachusetts Institute of Technology. He is a co-founder of Interactive Motion Technologies, Inc., and a board member of Advanced Mechanical Technologies, Inc. Born in Dublin, Ireland, he earned a Dip. Eng. (with distinction) from Dublin College of Technology and M.S., M.E. and Ph.D. degrees from MIT. Following industrial experience in engineering design, he joined MIT’s School of Engineering faculty in 1979 and has served as Head and Associate Head of the Mechanical Engineering department’s System Dynamics and Control division. Awards include an Honorary Doctorate from the Delft University of Technology; the Silver Medal of the Royal Academy of Medicine in Ireland; and an Honorary Doctorate from the Dublin Institute of Technology. Professor Hogan’s research is broad and multi-disciplinary, extending from biology to engineering—it has made significant contributions to motor neuroscience, rehabilitation engineering and robotics—but its focus converges on an emerging class of machines designed to cooperate physically with humans. Recent work pioneered the creation of robots sufficiently gentle to provide physiotherapy to frail and elderly patients recovering from neurological injury such as stroke, a novel therapy that has already proven its clinical significance.\n\n\nFaculty Host: Matt Mason\n    \n  \n        \nPoster    \n  \n        \nEvent Website    \n  \n    Keywords:     \nRI    \n  \n    For More Information, Please Contact:     \n\n\n\njs3g [atsymbol] andrew.cmu.edu", "Time": "2016-03-18 15:30:00-04:00", "URL": "https://www.scs.cmu.edu/calendar/fri-2016-03-18-1530/robotics-seminar", "University": "Carnegie Mellon University", "Tags": "", "Venue": "Newell-Simon Hall"}, {"Topic": "Next-Generation Cosmological Simulations: Galaxy Assembly and Evolution    ", "Speaker": "LARS HERNQUIST    ", "Description": "Lecture    \n  \n        \nLARS HERNQUIST    \n  \n        \nMallinckrodt Professor of Astrophysics     \n  \n        \nHarvard University    \n  \n        \nNext-Generation Cosmological Simulations: Galaxy Assembly and Evolution    \n  \n        \nTuesday, March 15, 2016 - 4:30pm    \n  \n        \nRashid Auditorium 4401     \n  \n        \nGates&Hillman Centers    \n  \n        \n\n\n[View Map]\n    \n  \n    Abstract:     \n\n\nA predictive theory of galaxy formation remains elusive, even after more than 50 years of dedicated effort by many renowned astrophysicists. The problem of galaxy formation is made difficult by the large range in scales involved and the many non-linear physical processes at work. This talk describes a new generation of numerical models that are designed to overcome these difficulties based on novel schemes for solving the fluid equations on a moving mesh. Initial results from this study provide insight into many aspects of galaxy assembly and the relationship between galaxies and cosmologically-distributed baryons.\n\n\nReception to Follow.\n    \n  \n        \nSeries Website    \n  \n    Keywords:     \nPhysics    \n  \n    For More Information, Please Contact:     \n\n\n\nphysics [atsymbol] andrew.cmu.edu", "Time": "2016-03-15 16:30:00-04:00", "URL": "https://www.scs.cmu.edu/calendar/tue-2016-03-15-1630/bennett-mcwilliams-lecture", "University": "Carnegie Mellon University", "Tags": "", "Venue": "Gates&Hillman Centers"}, {"Topic": "A Theory and Tools for Applying Sandboxes Effectively    ", "Speaker": "MICHAEL MAASS    ", "Description": "Thesis Orals    \n  \n        \nMICHAEL MAASS    \n  \n        \nPh.D. Student    \n  \n        \nPh.D. Program in Software Engineering    \n  \n        \nInstitute for Software Research, Carnegie Mellon University    \n  \n        \nA Theory and Tools for Applying Sandboxes Effectively    \n  \n        \nMonday, March 7, 2016 - 1:00pm    \n  \n        \nReddy Conference Room 4405     \n  \n        \nGates&Hillman Centers    \n  \n        \n\n\n[View Map]\n    \n  \n    Abstract:     \n\n\nIt is essentially impossible to build modern software without extensive supply chains. Supply chains decrease development risk, but typically at the cost of increased security risk. In particular, it is often difficult to trust or verify that a component contains no unwanted behaviors, vulnerabilities, or malicious code that may harm an application or its users.\n\n\nSandboxes provide relief by encapsulating a component and imposing a security policy on it. Instead of trusting or verifying the component, we must trust or verify the relatively simple sandbox. Given this appealing prospect, researchers have spent decades developing new sandboxes. However, sandboxes are rarely used in practice. What is hampering adoption? This thesis advances our understanding of and overcomes some barriers to adoption.\n\n\nWe begin by systematically analyzing a decade of sandboxing research from relevant top-tier conferences. This work uncovers our first two challenges: sandbox researchers often (1) use relatively subjective validation techniques and (2) ignore usability.\n\n\nWe then focus on the Java sandbox to empirically study its use within the open source community. We find unnecessary complexity in the sandbox that has promoted a thriving exploit landscape. We develop run time monitors for the Java Virtual Machine (JVM) that disable these complexity points, stopping sandbox escaping exploits without breaking compatibility with benign applications. However, we found no cases where the sandbox was successfully used for security purposes, which motivated us to overcome necessary complexity via tooling. Our tools help users derive and refine a security policy and impose it on targeted Java application components.\n\n\nFinally, we observe vulnerability-inducing design and implementation complexity in adopted sandboxes, and thus develop and evaluate a sandboxing technique that leverages cloud computing environments to execute untrusted computations. Any malicious outcomes produced by the computations are contained by ephemeral virtual machines.\n\n\nWe evaluate our tools and sandbox in a series of case studies that investigate hard-to-sandbox cases in collaboration with industrial partners.\n\n\nThesis Committee:Jonathan Aldrich (Co-chair) William L. Scherlis (Co-chair) Lujo Bauer (ECE/ISR)Bruno Amizic (The Boeing Company)\n\n\nCopy of Thesis Document\n    \n  \n        \nPoster    \n  \n    Keywords:     \nISR    \n  \n    For More Information, Please Contact:     \n\n\n\ncherold [atsymbol] andrew.cmu.edu", "Time": "2016-03-07 13:00:00-05:00", "URL": "https://www.scs.cmu.edu/calendar/mon-2016-03-07-1300/software-engineering-theisis-defense", "University": "Carnegie Mellon University", "Tags": "", "Venue": "Gates&Hillman Centers"}, {"Topic": "Attacking Data-Independent Memory-Hard Functions    ", "Speaker": "JEREMIAH BLOCKI    ", "Description": "Lecture    \n  \n        \nJEREMIAH BLOCKI    \n  \n        \nPostdoctoral Fellow    \n  \n        \nMicrosoft Research    \n  \n        \nAttacking Data-Independent Memory-Hard Functions    \n  \n        \nFriday, March 25, 2016 - 10:30am    \n  \n        \n8102     \n  \n        \nGates&Hillman Centers    \n  \n        \n\n\n[View Map]\n    \n  \n    Abstract:     \n\n\nWe demonstrate an algorithm for evaluating data-independent memory-hard functions (iMHFs) with significantly less cumulative resources (e.g., memory/energy) than ideally desired of such algorithms. Data-independent memory-hard functions are defined by fixing a directed acyclic graph (DAG) G on n nodes which represents the dependence between the inputs and outputs of n  calls to an underlying compression function H. Ideally we would like that to compute an iMHF (even allowing parallel calls to H) the cumulative computational resources required should be Omega(n^2). That is either the sum of the amount of memory used at each time step should be at least Omega(n^2) or the total number of queries to H should be at least Omega(n^2). In this work we demonstrate attacks on iMHFs based on three classes of DAGs each using o(n^2) resources. In particular we get that:\n\n\n(1) The Catena-Dragonfly iMHF can be computed by an algorithm with cumulative complexity O(n^{1.67}). Similarly, the cumulative complexity of the newer Catena-Butterfly iMHF is O(n^{1.67}).\n\n\n(2) The Argon2i iMHF (winner of the Password Hashing Competition) can be computed by an algorithm with cumulative complexity O(n^{7/4}\\log(n)).\n\n\n(3) Any iMHF can be computed by an algorithm with cumulative complexity O(n^2/\\log^{1-\\epsilon}(n)) for all epsilon > 0.\n\n\nAt a technical level we provide a general attack against any iMHF defined by a DAG $G=(V,E)$ that is not depth-robust, meaning that we can find a ``small' set $S\\subset V$ of nodes such that $G-S$ does not contain a ``long' path.  We demonstrate that the Catena and Argon2i DAGs are not depth robust in an extreme sense. Furthermore, no simple DAG (constant indegree) is sufficiently depth robust to resist an attack with cumulative complexity  O(n^2/\\log^{1-\\epsilon}(n)). This shows that the goal of constructing an iMHF requiring Omega(n^2) cumulative resources is unachievable.\n\n\nJoint work with Joel Alwen (IST Austria)\n\n\nAbout the Speaker\n\n\n \n    \n  \n    Keywords:     \nCSD    \n  \n    For More Information, Please Contact:     \n\n\n\nnlc [atsymbol] cs.cmu.edu", "Time": "2016-03-25 10:30:00-04:00", "URL": "https://www.scs.cmu.edu/calendar/fri-2016-03-25-1030/computer-science-distinguished-lecture", "University": "Carnegie Mellon University", "Tags": "", "Venue": "Gates&Hillman Centers"}, {"Topic": "Exploiting the Environment to Improve Autonomy: Robots in Geophysical Flows    ", "Speaker": "M. ANI HSIEH    ", "Description": "Seminars    \n  \n        \nM. ANI HSIEH    \n  \n        \nAssociate Professor    \n  \n        \nMechanical Engineering and Mechanics Department    \n  \n        \nDrexel University    \n  \n        \nExploiting the Environment to Improve Autonomy: Robots in Geophysical Flows    \n  \n        \nFriday, March 4, 2016 - \n3:30pm to 4:30pm    \n  \n        \nMauldin Auditorium 1305     \n  \n        \nNewell-Simon Hall    \n  \n        \n\n\n[View Map]\n    \n  \n    Abstract:     \n\n\nDifferent from many aerial and ground robots, underwater robots operate in a communication and localization-limited environment where their dynamics are tightly coupled with the environmental dynamics. While the tight-coupling between vehicle and environment dynamics makes control challenging, it provides a unique opportunity for robots to exploit the environmental forces to improve and prolong their autonomy. In this talk, I'll show the limitations of existing air and ground based strategies and present our efforts in improving vehicle autonomy by better understanding the dynamics of the geophysical fluid environment. The talk will describe our efforts in using robot teams to track coherent structures. Coherent structures are of great importance since they give us a way to map and represent the dynamics of the fluid environment. I will then show how this information can then be exploited to develop more efficient control and coordination strategies for networks of AUVs/ASVs operating in these environments.\n\n\n—\n\n\nM. . Ani Hsieh is an Associate Professor in the Mechanical Engineering & Mechanics Department at Drexel University. She received a B.S. in Engineering and B.A. in Economics from Swarthmore College in 1999 and a PhD in Mechanical Engineering from the University of Pennsylvania in 2007. Her current work focuses on developing a general control and coordination framework for distributed sensing and monitoring of dynamic and uncertain environments by mobile robot teams. She is a recipient of a 2012 Office of Naval Research (ONR) Young Investigator Award and a 2013 National Science Foundation (NSF) CAREER Award.\n\n\nFaculty Host: Howie Choset\n    \n  \n        \nPoster    \n  \n        \nEvent Website    \n  \n    Keywords:     \nRI    \n  \n    For More Information, Please Contact:     \n\n\n\nkmmills [atsymbol] andrew.cmu.edu", "Time": "2016-03-04 15:30:00-05:00", "URL": "https://www.scs.cmu.edu/calendar/fri-2016-03-04-1530/robotics-seminar", "University": "Carnegie Mellon University", "Tags": "", "Venue": "Newell-Simon Hall"}, {"Topic": "'What the 0x5f3759df?!' Float Hacking    ", "Speaker": "TBD", "Description": "Talks    \n  \n        \n'What the 0x5f3759df?!' Float Hacking    \n  \n        \nWednesday, April 27, 2016 - \n8:00pm to 9:00pm    \n  \n        \n5421     \n  \n        \nWean Hall    \n  \n        \n\n\n[View Map]\n    \n  \n    Abstract:     \n\n\nLegends tell of a mysterious C function capable of approximating a floating point inverse square root with merely a few integer operations and the fabled 'magic constant.' Come to this talk to discover this confounding secret of old and witness quite a few fun coding hacks along the way!\n\n\n—\n\n\nHave you ever wondered how fast inverse square root works, wanted to learn a bit of computing history, or craved the thrill of learning a new language again, but didn't know where to start looking? Look no further! Whether you're a hacking veteran or a newfound computer lover, there's something for you in Computer Club's Spring 2016 weekly talk series, so swing on by!\n\n\nSponsored by Green Hills Software.\n    \n  \n        \nSeries Poster    \n  \n        \nSeries Website    \n  \n    Keywords:     \nCMUCC", "Time": "2016-04-27 20:00:00-04:00", "URL": "https://www.scs.cmu.edu/calendar/wed-2016-04-27-2000/carnegie-mellon-computer-club-spring-talk-series", "University": "Carnegie Mellon University", "Tags": "", "Venue": "Wean Hall"}, {"Topic": "CoffeeScript => WebGL Solar Systems!    ", "Speaker": "TBD", "Description": "Talks    \n  \n        \nCoffeeScript => WebGL Solar Systems!    \n  \n        \nWednesday, April 20, 2016 - \n8:00pm to 9:00pm    \n  \n        \n5421     \n  \n        \nWean Hall    \n  \n        \n\n\n[View Map]\n    \n  \n    Abstract:     \n\n\nCoffeeScript is a nifty little language which can be used to write simultaneously more clear and more complicated code. In this workshop, we will examine some of the more interesting consequences of using CoffeeScript with existing JavaScript frameworks.\n\n\n—\n\n\nHave you ever wondered how fast inverse square root works, wanted to learn a bit of computing history, or craved the thrill of learning a new language again, but didn't know where to start looking? Look no further! Whether you're a hacking veteran or a newfound computer lover, there's something for you in Computer Club's Spring 2016 weekly talk series, so swing on by!\n\n\nThe talksl take place every Wednesday starting at 8:00 PM in Wean 5421 throughout the semester.\n\n\nSponsored by Green Hills Software.\n    \n  \n        \nSeries Poster    \n  \n        \nSeminar Website    \n  \n    Keywords:     \nCMUCC", "Time": "2016-04-20 20:00:00-04:00", "URL": "https://www.scs.cmu.edu/calendar/wed-2016-04-20-2000/carnegie-mellon-computer-club-spring-talk-series", "University": "Carnegie Mellon University", "Tags": "", "Venue": "Wean Hall"}, {"Topic": "Introduction to Linux Kernel Hacking    ", "Speaker": "TBD", "Description": "Talks    \n  \n        \nIntroduction to Linux Kernel Hacking    \n  \n        \nWednesday, April 13, 2016 - \n8:00pm to 9:00pm    \n  \n        \n5421     \n  \n        \nWean Hall    \n  \n        \n\n\n[View Map]\n    \n  \n    Abstract:     \n\n\nWant to investigate being a kernel hacker, but don't know how to get started? Well, maybe you should read the documentation! But barring that, you can come to this workshop! We'll go over all the basics and get you started on the next steps to learn more. Please make sure to have root access to a virtual machine running Linux before attending, so you can build and boot your own kernel! Or, if you're especially hardcore, bring along some hardware and hack on that!\n\n\n—\n\n\nHave you ever wondered how fast inverse square root works, wanted to learn a bit of computing history, or craved the thrill of learning a new language again, but didn't know where to start looking? Look no further! Whether you're a hacking veteran or a newfound computer lover, there's something for you in Computer Club's Spring 2016 weekly talk series, so swing on by!\n\n\nThe talksl take place every Wednesday starting at 8:00 PM in Wean 5421 throughout the semester.\n\n\nSponsored by Green Hills Software.\n    \n  \n        \nSeries Poster    \n  \n        \nSeries Website    \n  \n    Keywords:     \nCMUCC", "Time": "2016-04-13 20:00:00-04:00", "URL": "https://www.scs.cmu.edu/calendar/wed-2016-04-13-2000/carnegie-mellon-computer-club-spring-talk-series", "University": "Carnegie Mellon University", "Tags": "", "Venue": "Wean Hall"}, {"Topic": "Build a JIT Compiler in 60 Minutes    ", "Speaker": "TBD", "Description": "Talks    \n  \n        \nBuild a JIT Compiler in 60 Minutes    \n  \n        \nWednesday, April 6, 2016 - \n8:00pm to 9:00pm    \n  \n        \n5421     \n  \n        \nWean Hall    \n  \n        \n\n\n[View Map]\n    \n  \n    Abstract:     \n\n\nCompilers: not as hard as you think! This interactive workshop will teach you the architecture of modern compilers and have you write one of your own. Experience with SML or OCaml is recommended\n\n\n—\n\n\nHave you ever wondered how fast inverse square root works, wanted to learn a bit of computing history, or craved the thrill of learning a new language again, but didn't know where to start looking? Look no further! Whether you're a hacking veteran or a newfound computer lover, there's something for you in Computer Club's Spring 2016 weekly talk series, so swing on by!\n\n\nThe talksl take place every Wednesday starting at 8:00 PM in Wean 5421 throughout the semester.\n\n\nSponsored by Green Hills Software.\n    \n  \n        \nSeries Poster    \n  \n        \nSeries Website    \n  \n    Keywords:     \nCMUCC", "Time": "2016-04-06 20:00:00-04:00", "URL": "https://www.scs.cmu.edu/calendar/wed-2016-04-06-2000/carnegie-mellon-computer-club-spring-talk-series", "University": "Carnegie Mellon University", "Tags": "", "Venue": "Wean Hall"}, {"Topic": "Customization and Programming in Emacs Lisp    ", "Speaker": "TBD", "Description": "Talks    \n  \n        \nCustomization and Programming in Emacs Lisp    \n  \n        \nWednesday, March 30, 2016 - \n8:00pm to 9:00pm    \n  \n        \n5421     \n  \n        \nWean Hall    \n  \n        \n\n\n[View Map]\n    \n  \n    Abstract:     \n\n\nDo you use Emacs, but don't know anything about Emacs Lisp, the language that Emacs is written in and customized with? Then come to this workshop; we'll write a few useful snippets and extensions from scratch, and you'll see how absolutely trivial it is to add powerful functionality with Emacs Lisp.\n\n\n—\n\n\nHave you ever wondered how fast inverse square root works, wanted to learn a bit of computing history, or craved the thrill of learning a new language again, but didn't know where to start looking? Look no further! Whether you're a hacking veteran or a newfound computer lover, there's something for you in Computer Club's Spring 2016 weekly talk series, so swing on by!\n\n\nThe talksl take place every Wednesday starting at 8:00 PM in Wean 5421 throughout the semester.\n\n\nSponsored by Green Hills Software.\n    \n  \n        \nSeries Poster    \n  \n        \nSeries Website    \n  \n    Keywords:     \nCMUCC", "Time": "2016-03-30 20:00:00-04:00", "URL": "https://www.scs.cmu.edu/calendar/wed-2016-03-30-2000/carnegie-mellon-computer-club-spring-talk-series", "University": "Carnegie Mellon University", "Tags": "", "Venue": "Wean Hall"}, {"Topic": "COBOL: 57 Years Old and Still Punching (Cards)    ", "Speaker": "TBD", "Description": "Talks    \n  \n        \nCOBOL: 57 Years Old and Still Punching (Cards)    \n  \n        \nWednesday, March 23, 2016 - \n8:00pm to 9:00pm    \n  \n        \n5421     \n  \n        \nWean Hall    \n  \n        \n\n\n[View Map]\n    \n  \n    Abstract:     \n\n\nIn the 1950s, languages such as COBOL and FORTRAN were a refreshing change from everything being written in assembler. Today they're seen as scary old junk, but that 'old junk' still keeps a lot of the world running. (Yes, this talk is intended to be at least partially humorous... Come on, it's a talk about COBOL in 2016.)\n\n\n—\n\n\nHave you ever wondered how fast inverse square root works, wanted to learn a bit of computing history, or craved the thrill of learning a new language again, but didn't know where to start looking? Look no further! Whether you're a hacking veteran or a newfound computer lover, there's something for you in Computer Club's Spring 2016 weekly talk series, so swing on by!\n\n\nThe talksl take place every Wednesday starting at 8:00 PM in Wean 5421 throughout the semester.\n\n\nSponsored by Green Hills Software.\n    \n  \n        \nSeries Poster    \n  \n        \nSeries Website    \n  \n    Keywords:     \nCMUCC", "Time": "2016-03-23 20:00:00-04:00", "URL": "https://www.scs.cmu.edu/calendar/wed-2016-03-23-2000/carnegie-mellon-computer-club-spring-talk-series", "University": "Carnegie Mellon University", "Tags": "", "Venue": "Wean Hall"}, {"Topic": "Haskell for SML Programmers    ", "Speaker": "TBD", "Description": "Talks    \n  \n        \nHaskell for SML Programmers    \n  \n        \nWednesday, March 16, 2016 - \n8:00pm to 9:00pm    \n  \n        \n5421     \n  \n        \nWean Hall    \n  \n        \n\n\n[View Map]\n    \n  \n    Abstract:     \n\n\nHaskell is a strongly typed, lazy, purely functional language. We'll dispell some myths about Haskell, explain all the buzzwords, and introduce (and hopefully demystify) the dread Monad.\n\n\n—\n\n\nHave you ever wondered how fast inverse square root works, wanted to learn a bit of computing history, or craved the thrill of learning a new language again, but didn't know where to start looking? Look no further! Whether you're a hacking veteran or a newfound computer lover, there's something for you in Computer Club's Spring 2016 weekly talk series, so swing on by!\n\n\nThe talksl take place every Wednesday starting at 8:00 PM in Wean 5421 throughout the semester.\n\n\nSponsored by Green Hills Software.\n    \n  \n        \nSeries Poster    \n  \n        \nSeries Website    \n  \n    Keywords:     \nCMUCC", "Time": "2016-03-16 20:00:00-04:00", "URL": "https://www.scs.cmu.edu/calendar/wed-2016-03-16-2000/carnegie-mellon-computer-club-spring-talk-series", "University": "Carnegie Mellon University", "Tags": "", "Venue": "Wean Hall"}]}